-- --------------------------------------------------------
-- Host:                         143.110.189.33
-- Server version:               8.0.41 - Source distribution
-- Server OS:                    Linux
-- HeidiSQL Version:             12.11.0.7065
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;


-- Dumping database structure for samadhan
CREATE DATABASE IF NOT EXISTS `samadhan` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `samadhan`;

-- Dumping structure for table samadhan.admins
DROP TABLE IF EXISTS `admins`;
CREATE TABLE IF NOT EXISTS `admins` (
  `id` int NOT NULL AUTO_INCREMENT,
  `email` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  `name` varchar(255) DEFAULT NULL,
  `phone` varchar(20) DEFAULT NULL,
  `role` varchar(50) DEFAULT 'admin',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `username` varchar(25) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `email` (`email`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- Dumping data for table samadhan.admins: ~4 rows (approximately)
DELETE FROM `admins`;
INSERT INTO `admins` (`id`, `email`, `password`, `name`, `phone`, `role`, `created_at`, `updated_at`, `username`) VALUES
	(1, 'demo@samadhan.in', 'demo123', 'Demo Admin', '1234567890', 'admin', '2025-07-30 09:38:36', '2025-07-30 15:46:51', 'demoUser'),
	(2, 'admin1@samadhan.com', '123456', 'admin 1', '9638527410', 'admin', '2025-08-21 08:40:34', '2025-08-21 08:40:34', 'admin123'),
	(3, 'demo@email.com', 'Gourav@1234', 'Gourav Gilhare', '4444444444', 'admin', '2025-08-21 15:43:55', '2025-08-21 15:43:55', 'gouravgilhare'),
	(4, 'demo1@samadhan.in', '123456', 'demo admin', '7418529630', 'admin', '2025-08-21 18:55:30', '2025-08-21 18:55:30', 'demo admin');

-- Dumping structure for table samadhan.callcenter
DROP TABLE IF EXISTS `callcenter`;
CREATE TABLE IF NOT EXISTS `callcenter` (
  `id` int NOT NULL AUTO_INCREMENT,
  `pending` int DEFAULT '0',
  `resolve` int DEFAULT '0',
  `total` int GENERATED ALWAYS AS ((`pending` + `resolve`)) STORED,
  `createdAt` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- Dumping data for table samadhan.callcenter: ~1 rows (approximately)
DELETE FROM `callcenter`;
INSERT INTO `callcenter` (`id`, `pending`, `resolve`, `createdAt`) VALUES
	(1, 0, 0, '2025-08-21 08:38:56');

-- Dumping structure for table samadhan.cm_jandarshan
DROP TABLE IF EXISTS `cm_jandarshan`;
CREATE TABLE IF NOT EXISTS `cm_jandarshan` (
  `id` int NOT NULL AUTO_INCREMENT,
  `pending` int DEFAULT '0',
  `resolve` int DEFAULT '0',
  `total` int GENERATED ALWAYS AS ((`pending` + `resolve`)) STORED,
  `createdAt` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- Dumping data for table samadhan.cm_jandarshan: ~1 rows (approximately)
DELETE FROM `cm_jandarshan`;
INSERT INTO `cm_jandarshan` (`id`, `pending`, `resolve`, `createdAt`) VALUES
	(1, 0, 0, '2025-08-21 08:38:56');

-- Dumping structure for table samadhan.coll_jandarshan
DROP TABLE IF EXISTS `coll_jandarshan`;
CREATE TABLE IF NOT EXISTS `coll_jandarshan` (
  `id` int NOT NULL AUTO_INCREMENT,
  `pending` int DEFAULT '0',
  `resolve` int DEFAULT '0',
  `total` int GENERATED ALWAYS AS ((`pending` + `resolve`)) STORED,
  `createdAt` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- Dumping data for table samadhan.coll_jandarshan: ~1 rows (approximately)
DELETE FROM `coll_jandarshan`;
INSERT INTO `coll_jandarshan` (`id`, `pending`, `resolve`, `createdAt`) VALUES
	(1, 0, 0, '2025-08-21 08:38:56');

-- Dumping structure for table samadhan.complaint_reciever
DROP TABLE IF EXISTS `complaint_reciever`;
CREATE TABLE IF NOT EXISTS `complaint_reciever` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `contact_no` varchar(15) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `complaint_id` int DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `complaint_id` (`complaint_id`),
  CONSTRAINT `complaint_reciever_ibfk_1` FOREIGN KEY (`complaint_id`) REFERENCES `jandarshan_data` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- Dumping data for table samadhan.complaint_reciever: ~0 rows (approximately)
DELETE FROM `complaint_reciever`;

-- Dumping structure for table samadhan.dashboard_stats
DROP TABLE IF EXISTS `dashboard_stats`;
CREATE TABLE IF NOT EXISTS `dashboard_stats` (
  `id` int NOT NULL AUTO_INCREMENT,
  `total_complaints` bigint DEFAULT '0',
  `resolved` bigint DEFAULT '0',
  `pending` int DEFAULT '0',
  `createdAt` datetime DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- Dumping data for table samadhan.dashboard_stats: ~0 rows (approximately)
DELETE FROM `dashboard_stats`;

-- Dumping structure for table samadhan.jandarshan_data
DROP TABLE IF EXISTS `jandarshan_data`;
CREATE TABLE IF NOT EXISTS `jandarshan_data` (
  `id` int NOT NULL AUTO_INCREMENT,
  `main_department` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `department_name` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `officer_designation` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `cm_jandarshan` int DEFAULT NULL,
  `collector_jandarshan` int DEFAULT NULL,
  `jansikayatWEB` int DEFAULT NULL,
  `jansikayatPostMail` int DEFAULT NULL,
  `pgPortal` int DEFAULT NULL,
  `call_center` int DEFAULT NULL,
  `total_complaints` int DEFAULT NULL,
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=196 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- Dumping data for table samadhan.jandarshan_data: ~177 rows (approximately)
DELETE FROM `jandarshan_data`;
INSERT INTO `jandarshan_data` (`id`, `main_department`, `department_name`, `officer_designation`, `cm_jandarshan`, `collector_jandarshan`, `jansikayatWEB`, `jansikayatPostMail`, `pgPortal`, `call_center`, `total_complaints`, `created_at`) VALUES
	(1, 'नगरीय प्रशासन एवं विकास विभाग', 'नगर निगम', 'आयुक्त /1011000208', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(2, 'गृह विभाग', 'वरिष्ठ पुलिस अधीक्षक कार्यालय', 'वरिष्ठ पुलिस अधीक्षक /1011000301', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(3, 'राजस्व एवं आपदा प्रबंधन विभाग', 'अनुविभागीय अधिकारी , रायपुर्', 'अनुविभागीय अधिकारी /1011000246', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(4, 'राजस्व एवं आपदा प्रबंधन विभाग', 'अनुविभागीय अधिकारी आरंग', 'अनुविभागीय अधिकारी /1611000009', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(5, 'राजस्व एवं आपदा प्रबंधन विभाग', 'तहसील कार्यालय, रायपुर', 'तहसीलदार/1011000274', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(6, 'राजस्व एवं आपदा प्रबंधन विभाग', 'अनुविभागीय अधिकारी अभनपुर', 'अनुविभागीय अधिकारी /1011000291', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(7, 'ऊर्जा विभाग', 'छत्तीसगढ़ राज्य विद्युत वितरण कंपनी लिमि', 'कार्यपालन यंत्री /1011000197', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(8, 'राजस्व एवं आपदा प्रबंधन विभाग', 'तहसील गोबरा नवापारा', 'तहसीलदार/2311000003', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(9, 'नगरीय प्रशासन एवं विकास विभाग', 'रायपुर विकास प्राधिकरण, रायपुर', 'मुख्य कार्यपालन अधिकारी /1011000319', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(10, '', 'C.G.housing board', '', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(11, '', 'CSIDC', '', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(12, 'नगरीय प्रशासन एवं विकास विभाग', 'अटल नगर विकास प्राधिकरण, रायपुर', 'मुख्य कार्यपालन अधिकारी /1011000356', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(13, 'राजस्व एवं आपदा प्रबंधन विभाग', 'अनुविभागीय अधिकारी तिल्दा-नेवरा, रायपुर', 'अनुविभागीय अधिकारी /2211000002', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(14, 'राजस्व एवं आपदा प्रबंधन विभाग', 'तहसील कार्यालय, तिल्दा', 'तहसीलदार/1011000269', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(15, 'स्कूल शिक्षा विभाग', 'शिक्षा जिला, रायपुर', 'जिला शिक्षा अधिकारी /1011000300', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(16, 'समाज कल्याण विभाग ', 'जिला कार्यालय समाज कल्याण', 'संयुक्त संचालक/1711000053', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(17, 'राजस्व एवं आपदा प्रबंधन विभाग', 'तहसील कार्यालय, अभनपुर', 'तहसीलदार/1011000271', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(18, 'लोक स्वास्थ्य, परिवार कल्याण एवं चिकित्सा शिक्षा विभाग', 'जिला आयुष रायपुर', 'जिला आयुर्वेद अधिकारी/2511000007', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(19, 'पंचायत एवं ग्रामीण विकास विभाग', 'जनपद पंचायत, आरंग', 'मुख्य कार्यपालन अधिकारी /1011000254', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(20, 'श्रम विभाग', 'श्रम विभाग, रायपुर', 'सहायक आयुक्त /1011000355', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(21, 'नगरीय प्रशासन एवं विकास विभाग', 'नगर पालिका परिषद् , तिल्दानेवारा', 'मुख्य नगर पालिका अधिकारी /1111000465', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(22, 'खाद्य नागरिक आपूर्ति एवं उपभोक्ता संरक्षण विभाग', 'जिला खाद्य नियंत्रक , रायपुर', 'खादय नियंत्रक/1011000299', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(23, 'लोक स्वास्थ्य, परिवार कल्याण एवं चिकित्सा शिक्षा विभाग', 'कार्यालय मुख्य चिकित्सा एवं स्वास्थ्य अधिकारी, रायपुर', 'मुख्य चिकित्सा एवं स्वास्थ अधिकारी /1011000318', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(24, 'सार्वजनिक उपक्रम विभाग', 'Lead Bank Manager', 'प्रबंध संचालक /1711000059', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(25, 'वाणिज्य और उद्योग विभाग', 'जिला उद्योग केंद्र, रायपुर', 'महाप्रबंधक /1011000313', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(26, 'आदिम जाति तथा अनुसूचित जाति, पिछड़ा वर्ग एवं अल्पसंख्यक विकास विभाग', 'आदिवासी विकास, रायपुर', 'सहायक आयुक्त /1011000283', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(27, 'वन एवं जलवायु परिवर्तन विभाग', 'रायपुर वनमंडल, रायपुर', 'वन मण्डलाधिकारी /1011000331', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(28, 'उच्च शिक्षा विभाग', 'पं.रविशंकर शुक्ल विश्वविद्यालय', 'कुलपति /1011000234', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(29, 'सहकारिता विभाग', 'उप आयुक्‍त सहकारिता एवं उप पंजीयक सहकारी संस्थाएं, रायपुर', 'उप पंजीयक /1011000295', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(30, 'वित्त विभाग', 'वित्त शाखा, जिला कार्यालय, रायपुर', 'प्रभारी अधिकारी/1011000290', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(31, 'पंचायत एवं ग्रामीण विकास विभाग', 'जिला पंचायत', 'मुख्य कार्यपालन अधिकारी /1011000213', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(32, 'नगरीय प्रशासन एवं विकास विभाग', 'नगर निगम, बीरगांव', 'आयुक्त /1011000320', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(33, 'वाणिज्यिक कर विभाग', 'कार्यालय जिला पंजीयक, रायपुर', 'जिला पंजीयक /1011000349', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(34, 'परिवहन विभाग', 'RTO OFFICE', 'क्षेत्रिय परिवहन अधिकारी/1711000057', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(35, 'वन एवं जलवायु परिवर्तन विभाग', 'वन संरक्षक, वन प्रबंधन सूचना प्रणाली, रायपुर', 'वन मण्डलाधिकारी /1011000334', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(36, 'जल संसाधन विभाग', 'मुख्य अभियंता महानदी परियोजना ,जल संसाधन विभाग', 'मुख्य अभियंता /1011000052', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(37, 'लोक निर्माण विभाग', 'लोक निर्माण विभाग, क्रमांक 2', 'कार्यपालन यंत्री /1011000285', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(38, 'वन एवं जलवायु परिवर्तन विभाग', 'जंगल सफारी वनमंडल, रायपुर', 'वन मण्डलाधिकारी /1011000332', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(39, 'पंचायत एवं ग्रामीण विकास विभाग', 'जनपद पंचायत, अभनपुर', 'मुख्य कार्यपालन अधिकारी /1011000255', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(40, 'मछ्ली पालन विभाग', 'मत्स्य विभाग, रायपुर', 'उप संचालक/1011000354', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(41, 'राजस्व एवं आपदा प्रबंधन विभाग', 'तहसील धरसींवा, रायपुर', 'अतिरिक्त तहसीलदार /1011000316', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(42, 'राजस्व एवं आपदा प्रबंधन विभाग', 'भू आबंटन शाखा', 'प्रभारी अधिकारी/2211000004', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(43, 'राजस्व एवं आपदा प्रबंधन विभाग', 'तहसील मंदिर हसोद', 'अतिरिक्त तहसीलदार /1611000004', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(44, 'सहकारिता विभाग', 'जिला सहकारी केंद्रीय बैंक मर्यादित, रायपुर', 'महाप्रबंधक /1011000341', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(45, 'वाणिज्यिक कर विभाग', 'आबकारी, रायपुर', 'सहायक आयुक्त /1011000282', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(46, 'वाणिज्यिक कर विभाग', 'आबकारी, रायपुर', 'उपायुक्त/1211000024', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(47, 'नगरीय प्रशासन एवं विकास विभाग', 'नगर पंचायत, माना', 'मुख्य नगर पालिका अधिकारी /1111000515', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(48, 'नगरीय प्रशासन एवं विकास विभाग', 'नगर पालिका परिषद, अभनपुर, रायपुर', 'मुख्य नगर पालिका अधिकारी /1011000324', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(49, 'लोक निर्माण विभाग', 'परियोजना प्रबंधक ADB Project', 'परियोजना प्रबंधक/1811000003', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(50, 'महिला एवं बाल विकास विभाग', 'महिला एवं बाल विकास विभाग, रायपुर', 'जिला महिला एवं बाल विकास अधिकारी/1011000308', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(51, 'कृषि विभाग', 'कृषि विभाग, रायपुर', 'उप संचालक/1011000309', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(52, 'उच्च शिक्षा विभाग', 'पं.रविशंकर शुक्ल विश्वविद्यालय', 'कुलपति /1911000032', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(53, 'पशुपालन विभाग', 'पशु चिकित्सा एवं स्वास्थ्य सेवाए, रायपुर', 'उप संचालक/1011000307', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(54, 'खनिज साधन विभाग', 'खनिज शाखा', 'उप संचालक/1011000297', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(55, 'ऊर्जा विभाग', 'ØsMk', '', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(56, 'नगरीय प्रशासन एवं विकास विभाग', 'नगर पालिका परिषद् , गोबरानवापारा', 'मुख्य नगर पालिका अधिकारी /1111000475', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(57, 'विज्ञान और प्रोद्योगिकी विभाग', 'CHIPS district Centre', 'प्रबंधक /1711000040', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(58, 'नगरीय प्रशासन एवं विकास विभाग', 'नगर पंचायत, आरंग', 'मुख्य नगर पालिका अधिकारी /1011000327', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(59, 'आवास एवं पर्यावरण विभाग', 'पर्यावरण विभाग रायपुर', 'प्रभारी अधिकारी/1911000001', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(60, 'राजस्व एवं आपदा प्रबंधन विभाग', 'तहसील कार्यालय, आरंग', 'तहसीलदार/1011000270', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(61, 'वन एवं जलवायु परिवर्तन विभाग', 'मुख्य वन संरक्षक, रायपुर वृत्त', 'मुख्य वन संरक्षक /1711000020', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(62, 'सामान्य प्रशासन', 'प्रभारी अधिकारी स्वतंत्रता संग्राम अधिकारी शाखा', 'प्रभारी अधिकारी/1611000005', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(63, 'नगरीय प्रशासन एवं विकास विभाग', 'नगर पालिका परिषद, अभनपुर, रायपुर', 'मुख्य नगर पालिका अधिकारी /1011000325', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(64, 'विज्ञान और प्रोद्योगिकी विभाग', 'CHIPS district Centre', 'EDM /1711000039', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(65, 'समाज कल्याण विभाग ', 'छ.ग. समाज कल्‍याण बोर्ड', 'अध्यक्ष /1911000016', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(66, 'सामान्य प्रशासन', 'कार्यालय अतिरिक्त जिला दण्डाधिकारी, रायपुर', 'अतिरिक्‍त जिला दण्‍डाधिकारी /1011000348', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(67, 'लोक निर्माण विभाग', 'लोक निर्माण विभाग रायपुर', 'मुख्य अभियंता /1011000226', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(68, 'पशुपालन विभाग', 'पशु चिकित्सा एवं स्वास्थ्य सेवाए, रायपुर', 'संयुक्त संचालक/1211000013', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(69, 'सहकारिता विभाग', 'जिला सहकारी केंद्रीय बैंक मर्यादित, रायपुर', 'महाप्रबंधक /1011000341', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(70, 'पशुपालन विभाग', 'छत्तीसगढ़ राज्य पशुधन विकास अभिकरण', 'मुख्य कार्यपालन अधिकारी /1511000014', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(71, 'लोक स्वास्थ्य यांत्रिकी विभाग', 'Karya Palan Yantri, PHE Department, District Office Raipur', 'कार्यपालन यंत्री /1011000060', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(72, 'लोक स्वास्थ्य यांत्रिकी विभाग', 'लोक स्वास्थ्य यांत्रिकी विभाग, रायपुर', 'कार्यपालन यंत्री /1011000338', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(73, 'नगरीय प्रशासन एवं विकास विभाग', 'मुख्य नगर पालिका अधिकारी ,नगर पंचायत कूरा', 'मुख्य नगर पंचायत अधिकारी/1611000003', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(74, 'राजस्व एवं आपदा प्रबंधन विभाग', 'भाड़ा नियंत्रक', '', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(75, 'पंचायत एवं ग्रामीण विकास विभाग', 'जनपद पंचायत, धरसींवा', 'मुख्य कार्यपालन अधिकारी /1011000267', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(76, 'लोक निर्माण विभाग', 'लोक निर्माण विभाग (NH), रायपुर', 'कार्यपालन अभियंता/1911000071', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(77, 'राजस्व एवं आपदा प्रबंधन विभाग', 'नजूल शाखा, जिला कार्यालय, रायपुर', 'नजूल अधिकारी/1011000296', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(78, 'राजस्व एवं आपदा प्रबंधन विभाग', 'तहसील कार्यालय, खरोरा, रायपुर', 'तहसीलदार/2311000004', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(79, 'राजस्व एवं आपदा प्रबंधन विभाग', 'हिन्दी अभिलेख शाखा, जिला कार्यालय रायपुर', 'प्रभारी अधिकारी/1011000357', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(80, 'वाणिज्य और उद्योग विभाग', 'जिला उद्योग केंद्र, रायपुर', 'प्रबंधक /1111000504', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(81, 'आदिम जाति तथा अनुसूचित जाति, पिछड़ा वर्ग एवं अल्पसंख्यक विकास विभाग', 'जिला अंतत्यवसायी विकास, रायपुर', 'मुख्य कार्यपालन अधिकारी /1011000339', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(82, 'आदिम जाति तथा अनुसूचित जाति, पिछड़ा वर्ग एवं अल्पसंख्यक विकास विभाग', 'मध्य क्षेत्र आदिवासी विकास प्राधिकरण', 'सदस्य सचिव एवं आयुक्त/1911000074', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(83, 'आवास एवं पर्यावरण विभाग', 'छ.ग. भू-संपदा विनियामक प्राधिकरण (रेरा)', 'अध्यक्ष /1911000020', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(84, 'आवास एवं पर्यावरण विभाग', 'छ.ग. भाड़ा नियंत्रण अधिकरण', 'अध्यक्ष /1911000019', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(85, 'आवास एवं पर्यावरण विभाग', 'संयुक्त संचालक', 'संयुक्त संचालक/1711000041', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(86, 'उच्च शिक्षा विभाग', 'अटल बिहारी बाजपेयी विश्‍वविद्यालय', 'कुलपति /1911000044', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(87, 'उच्च शिक्षा विभाग', 'अटल बिहारी बाजपेयी विश्‍वविद्यालय', 'कुलसचिव /1911000045', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(88, 'उच्च शिक्षा विभाग', 'इंदिरा कला संगीत विश्‍वविद्यालय', 'कुलपति /1911000034', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(89, 'उच्च शिक्षा विभाग', 'इंदिरा कला संगीत विश्‍वविद्यालय', 'कुलसचिव /1911000035', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(90, 'उच्च शिक्षा विभाग', 'कुशाभाऊ ठकारे पत्रकारिता विश्‍वविद्यालय', 'कुलपति /1911000036', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(91, 'उच्च शिक्षा विभाग', 'कुशाभाऊ ठकारे पत्रकारिता विश्‍वविद्यालय', 'कुलसचिव /1911000037', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(92, 'उच्च शिक्षा विभाग', 'पं. दीनदयाल उपाध्‍याय स्‍मृति स्‍वास्‍थ्‍य, विज्ञान एवं आयुष विश्‍वविद्यालय', 'कुलपति /1911000066', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(93, 'उच्च शिक्षा विभाग', 'पं. सुन्‍दर लाल शर्मा (मुक्‍त) विश्‍वविद्यालय', 'कुलपति /1911000038', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(94, 'उच्च शिक्षा विभाग', 'पं. सुन्‍दर लाल शर्मा (मुक्‍त) विश्‍वविद्यालय', 'कुलसचिव /1911000039', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(95, 'उच्च शिक्षा विभाग', 'पं.रविशंकर शुक्ल विश्वविद्यालय', 'कुलसचिव /1911000033', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(96, 'उच्च शिक्षा विभाग', 'बस्‍तर विश्‍वविद्यालय', 'कुलसचिव /1911000041', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(97, 'उच्च शिक्षा विभाग', 'सत गहिरा गुरू विश्‍वविद्यालय', 'कुलसचिव /1911000043', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(98, 'उच्च शिक्षा विभाग', 'हेमचंद यादव विश्‍वविद्यालय', 'कुलपति /1911000046', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(99, 'उच्च शिक्षा विभाग', 'हेमचंद यादव विश्‍वविद्यालय', 'कुलसचिव /1911000047', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(100, 'उद्यानिकी विभाग', 'उद्यानिकी, रायपुर', 'उप संचालक/1011000315', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(101, 'कृषि विभाग', 'कृषि संभागीय कार्यालय', 'संयुक्त संचालक/1611000016', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(102, 'कृषि विभाग', 'बीज प्रमाणीकरण संस्था रायपुर', 'प्रबंध संचालक /1811000009', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(103, 'कृषि विभाग', 'संभागीय संयुक्त संचालक कृषि', 'संयुक्त संचालक/1811000010', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(104, 'कौशल विकास, तकनीकी शिक्षा एवं रोजगार विभाग', 'जिला रोजगार कार्यालय', 'जिला रोजगार अधिकारी/1011000292', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(105, 'खनिज साधन विभाग', 'मिनरल डेव्‍हलपमेंट कार्पोरेशन लिमिटेड', 'अध्यक्ष /1911000012', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(106, 'खेल एवं युवा कल्याण विभाग', 'जिला खेल एवं युवा कल्याण विभाग कार्यालय', 'वरिष्ठ खेल अधिकारी /1111000457', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(107, 'गृह विभाग', 'कार्यालय अतिरिक्‍त पुलिस अधीक्षक, शहर रायपुर', 'अतिरिक्‍त पुलिस अधीक्षक, शहर रायपुर @1011000352', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(108, 'गृह विभाग', 'कार्यालय पुलिस महानिरिक्षक', 'पुलिस महानिरीक्षक /1111000391', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(109, 'गृह विभाग', 'जिला सेनानी नगर सेना माना कैंप रायपुर', 'जिला नगर सेनानी अधिकारी /2411000006', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(110, 'जन शिकायत निवारण विभाग', 'लि-1, जन शिकायत शाखा, जिला कार्यालय, रायपुर', 'प्रभारी अधिकारी/1011000293', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(111, 'जन शिकायत निवारण विभाग', 'लि-5, जन शिकायत शाखा, जिला कार्यालय, रायपुर', 'प्रभारी अधिकारी/1011000294', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(112, 'जनसंपर्क विभाग', 'जिला जनसंपर्क कार्यालय', 'सहायक संचालक/1111000447', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(113, 'जेल विभाग', 'केंद्रीय जेल, रायपुर', 'अधीक्षक /1011000340', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(114, 'जल संसाधन विभाग', 'जल संसाधन विभाग, रायपुर', 'कार्यपालन यंत्री /1011000342', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(115, 'धार्मिक न्यास और धर्मस्व विभाग', 'धार्मिक न्यास और धर्मस्व विभाग रायपुर', 'प्रभारी अधिकारी/2411000004', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(116, 'नगरीय प्रशासन एवं विकास विभाग', 'गोबरा नवापारा-राजिम', 'मुख्य नगर पालिका अधिकारी /1011000304', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(117, 'नगरीय प्रशासन एवं विकास विभाग', 'जिला शहरी विकास अभिकरण, रायपुर', 'परियोजना अधिकारी /1011000312', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(118, 'नगरीय प्रशासन एवं विकास विभाग', 'नगर निगम', 'महापौर /1011000209', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(119, 'नगरीय प्रशासन एवं विकास विभाग', 'नगर पंचायत मंदिर हसौद', 'मुख्य नगर पालिका अधिकारी /2311000002', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(120, 'नगरीय प्रशासन एवं विकास विभाग', 'नगर पंचायत, खरोरा', 'मुख्य नगर पालिका अधिकारी /1111000516', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(121, 'नगरीय प्रशासन एवं विकास विभाग', 'मुख्य नगर पालिका अधिकारी, समोदा', 'मुख्य नगर पालिका अधिकारी /2111000018', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(122, 'नगरीय प्रशासन एवं विकास विभाग', 'मुख्य नगर पालिका अधिकारी, चंदखुरी', 'मुख्य नगर पालिका अधिकारी /2111000019', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(123, 'पंचायत एवं ग्रामीण विकास विभाग', 'ग्रामीण यांत्रिकी सेवा, रायपुर', 'कार्यपालन यंत्री /1011000289', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(124, 'पंचायत एवं ग्रामीण विकास विभाग', 'जनपद पंचायत, तिल्दा', 'मुख्य कार्यपालन अधिकारी /1011000253', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(125, 'पंचायत एवं ग्रामीण विकास विभाग', 'जनपद पंचायत, राजिम', 'मुख्य कार्यपालन अधिकारी /1011000263', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(126, 'पंचायत एवं ग्रामीण विकास विभाग', 'जिला पंचायत', 'मुख्य कार्यपालन अधिकारी /2511000011', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(127, 'पंचायत एवं ग्रामीण विकास विभाग', 'पंचायत संचालनालय, रायपुर', 'उप संचालक/1011000314', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(128, 'पंचायत एवं ग्रामीण विकास विभाग', 'प्रधानमंत्री ग्राम सडक योजना, जिला रायपुर', 'कार्यपालन अभियंता/1011000351', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(129, 'पंचायत एवं ग्रामीण विकास विभाग', 'मुख्यमंत्री ग्राम सड़क योजना', 'कार्यपालन अभियंता/1311000004', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(130, 'पंचायत एवं ग्रामीण विकास विभाग', 'राज्‍य स्‍वच्‍छ भारत मिशन (ग्रामीण)', 'राज्य समन्वयक/1911000002', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(131, 'पशुपालन विभाग', 'छ.ग. राज्‍य जीव जन्‍तु कल्‍याण बोर्ड', 'अध्यक्ष /1911000023', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(132, 'मछ्ली पालन विभाग', 'छ.ग. राज्‍य मत्‍स्‍य महासंघ (सहकारी) मर्यादित', 'अध्यक्ष /1911000024', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(133, 'योजना, आर्थिक और सांख्यिकी विभाग', 'जिला सांख्यकीय अधिकारी', 'जि‍ला योजना एवं सांख्‍यकीय अधि‍कारी /1911000005', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(134, 'राजस्व एवं आपदा प्रबंधन विभाग', 'अपर कलेक्टर 01', 'अपर कलेक्टर/1211000020', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(135, 'राजस्व एवं आपदा प्रबंधन विभाग', 'अपर कलेक्टर 02 निधि साहू', 'अपर कलेक्टर/2411000003', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(136, 'राजस्व एवं आपदा प्रबंधन विभाग', 'तहसील कार्यालय, खरोरा, रायपुर', 'अतिरिक्त तहसीलदार /1011000317', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(137, 'राजस्व एवं आपदा प्रबंधन विभाग', 'तहसीलदार नजूल शाखा, जिला कार्यालय, रायपुर', 'तहसीलदार/1011000322', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(138, 'राजस्व एवं आपदा प्रबंधन विभाग', 'प्रपत्र शाखा कलेक्ट्रेट रायपुर', 'प्रभारी अधिकारी/2311000005', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(139, 'राजस्व एवं आपदा प्रबंधन विभाग', 'भू अर्जन, शाखा, जिला कार्यालय, रायपुर', 'प्रभारी अधिकारी/1011000347', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(140, 'राजस्व एवं आपदा प्रबंधन विभाग', 'भु-अभिलेख, रायपुर', 'अधीक्षक /1011000288', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(141, 'राजस्व एवं आपदा प्रबंधन विभाग', 'वरिष्ठ लिपिक शाखा', 'प्रभारी अधिकारी/1111000547', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(142, 'राजस्व एवं आपदा प्रबंधन विभाग', 'वाचक शाखा', 'प्रभारी अधिकारी/1111000548', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(143, 'राजस्व एवं आपदा प्रबंधन विभाग', 'सहायक अधीक्षक(राजस्व), कार्यालय कलेक्टर, रायपुर', 'प्रभारी अधिकारी/1011000329', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(144, 'लोक निर्माण विभाग', 'लोक निर्माण विभाग (E & M) रायपुर', 'कार्यपालन अभियंता/1911000006', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(145, 'लोक निर्माण विभाग', 'लोक निर्माण विभाग, क्रमांक 1', 'कार्यपालन यंत्री /1011000284', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(146, 'लोक निर्माण विभाग', 'लोक निर्माण विभाग, क्रमांक 3', 'कार्यपालन यंत्री /1011000286', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(147, 'लोक निर्माण विभाग', 'लोक निर्माण विभाग, विधानसभा संभाग्', 'कार्यपालन यंत्री /1011000287', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(148, 'लोक निर्माण विभाग', 'लोक निर्माण विभाग, विधानसभा संभाग्', 'कार्यपालन यंत्री /1011000287', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(149, 'लोक निर्माण विभाग', 'सेतु संभाग लोक निर्माण विभाग', 'कार्यपालन अभियंता/2411000002', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(150, 'लोक स्वास्थ्य यांत्रिकी विभाग', 'Mukhya Abhiyanta, PHE Department, District Office Raipur', 'मुख्य अभियंता /1011000061', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(151, 'लोक स्वास्थ्य, परिवार कल्याण एवं चिकित्सा शिक्षा विभाग', 'जिला चिकित्सालय, रायपुर', 'जिला मलेरिया अधिकारी/1211000025', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(152, 'लोक स्वास्थ्य, परिवार कल्याण एवं चिकित्सा शिक्षा विभाग', 'जिला चिकित्सालय, रायपुर', 'सिविल सर्जन/1011000303', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(153, 'वन एवं जलवायु परिवर्तन विभाग', 'उदन्ती वनमंडल, गरियाबंद', 'वन मण्डलाधिकारी /1011000335', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(154, 'वन एवं जलवायु परिवर्तन विभाग', 'वन अनुसंधान एवं विस्तार वनमंडल, रायपुर', 'वन मण्डलाधिकारी /1011000333', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(155, 'वाणिज्य और उद्योग विभाग', 'जिला उद्योग केंद्र, रायपुर', 'मुख्य महाप्रबंधक /1111000502', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(156, 'वाणिज्यिक कर विभाग', 'स्‍टेट मार्केटिंग कार्पोरेशन', 'अध्यक्ष /1911000010', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(157, 'वित्त विभाग', 'District Treasury Raipur', 'जिला कोषालय अधिकारी /1511000008', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(158, 'वित्त विभाग', 'संयुक्‍त संचालक कोष लेखा पेंशन,', 'संभागीय संयुक्‍त संचालक/2311000007', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(159, 'विधि और विधायी कार्य विभाग', 'जिला उपभोक्ता फोरम', 'अध्यक्ष /2211000003', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(160, 'श्रम विभाग', 'उप संचालक औद्योगिक स्वास्थ्य एवं सुरक्षा रायपुर, जिला रायपुर', 'उप संचालक/2511000016', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(161, 'श्रम विभाग', 'बालश्रम परियोजना, जिला कार्यालय, रायपुर', '', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(162, 'स्कूल शिक्षा विभाग', 'Rajiv Gandhi Siksha Mission', 'उप संचालक/1211000016', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(163, 'सुशासन एवं अभिसरण', 'सुशासन एवं अभिसरण', 'अवर सचिव /2511000013', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(164, 'संस्कृति विभाग', 'छ.ग. सिंधी अकादमी', 'अध्यक्ष /1911000018', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(165, 'संस्कृति विभाग', 'पदुमलाल पुन्‍नालाल बख्‍शी सृजनपीठ', 'अध्यक्ष /1911000017', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(166, 'सहकारिता विभाग', 'छत्‍तीसगढ राज्‍य सहकारी विपणन संघ मर्यादित, जिला रायपुर', 'जिला विपणन अधिकारी/1211000017', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(167, 'सहकारिता विभाग', 'छत्‍तीसगढ राज्‍य सहकारी विपणन संघ मर्यादित, जिला रायपुर', 'राज्य विपणन अधिकारी/1211000026', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(168, 'सहकारिता विभाग', 'संयुक्‍त आयुक्‍त सहकारिता एवं संयुक्‍त पंजीयक सहकारी संस्‍थाएं, रायपुर', 'संयुक्त पंजीयक/1711000063', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(169, 'सहकारिता विभाग', 'सहकारिता विभाग जिला विभाग', 'महानिदेशक /1011000163', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(170, 'सामान्य प्रशासन', 'Collector Office Raipur', 'कलेक्टर /1011000016', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(171, 'सामान्य प्रशासन', 'District Administration-Raipur', 'Admin/2311000001', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(172, 'सामान्य प्रशासन', 'आयुक्त कार्यालय', 'आयुक्त /1211000023', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(173, 'सामान्य प्रशासन', 'जिला निवार्चन, रायपुर', 'उप जिला निर्वाचन अधिकारी /1011000302', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(174, 'सामान्य प्रशासन', 'स्थानीय निर्वाचन शाखा, रायपुर', 'प्रभारी अधिकारी/1011000344', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(175, 'सार्वजनिक उपक्रम विभाग', 'BSNL', 'प्रभारी अधिकारी/1711000051', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(176, 'सार्वजनिक उपक्रम विभाग', 'National Highway', 'कार्यपालन अभियंता/1211000022', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(177, 'सार्वजनिक उपक्रम विभाग', 'Post Master General', 'मुख्य पोस्ट मास्टर /1211000019', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00');

-- Dumping structure for table samadhan.jandarshan_data_history
DROP TABLE IF EXISTS `jandarshan_data_history`;
CREATE TABLE IF NOT EXISTS `jandarshan_data_history` (
  `history_id` int NOT NULL AUTO_INCREMENT,
  `original_id` int DEFAULT NULL,
  `main_department` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `department_name` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `officer_designation` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `cm_jandarshan` int DEFAULT NULL,
  `collector_jandarshan` int DEFAULT NULL,
  `jansikayatWEB` int DEFAULT NULL,
  `jansikayatPostMail` int DEFAULT NULL,
  `pgPortal` int DEFAULT NULL,
  `call_center` int DEFAULT NULL,
  `total_complaints` int DEFAULT NULL,
  `snapshot_date` datetime DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`history_id`)
) ENGINE=InnoDB AUTO_INCREMENT=433 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- Dumping data for table samadhan.jandarshan_data_history: ~354 rows (approximately)
DELETE FROM `jandarshan_data_history`;
INSERT INTO `jandarshan_data_history` (`history_id`, `original_id`, `main_department`, `department_name`, `officer_designation`, `cm_jandarshan`, `collector_jandarshan`, `jansikayatWEB`, `jansikayatPostMail`, `pgPortal`, `call_center`, `total_complaints`, `snapshot_date`) VALUES
	(1, 1, 'नगरीय प्रशासन एवं विकास विभाग', 'नगर निगम', 'आयुक्त /1011000208', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(2, 2, 'गृह विभाग', 'वरिष्ठ पुलिस अधीक्षक कार्यालय', 'वरिष्ठ पुलिस अधीक्षक /1011000301', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(3, 3, 'राजस्व एवं आपदा प्रबंधन विभाग', 'अनुविभागीय अधिकारी , रायपुर्', 'अनुविभागीय अधिकारी /1011000246', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(4, 4, 'राजस्व एवं आपदा प्रबंधन विभाग', 'अनुविभागीय अधिकारी आरंग', 'अनुविभागीय अधिकारी /1611000009', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(5, 5, 'राजस्व एवं आपदा प्रबंधन विभाग', 'तहसील कार्यालय, रायपुर', 'तहसीलदार/1011000274', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(6, 6, 'राजस्व एवं आपदा प्रबंधन विभाग', 'अनुविभागीय अधिकारी अभनपुर', 'अनुविभागीय अधिकारी /1011000291', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(7, 7, 'ऊर्जा विभाग', 'छत्तीसगढ़ राज्य विद्युत वितरण कंपनी लिमि', 'कार्यपालन यंत्री /1011000197', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(8, 8, 'राजस्व एवं आपदा प्रबंधन विभाग', 'तहसील गोबरा नवापारा', 'तहसीलदार/2311000003', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(9, 9, 'नगरीय प्रशासन एवं विकास विभाग', 'रायपुर विकास प्राधिकरण, रायपुर', 'मुख्य कार्यपालन अधिकारी /1011000319', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(10, 10, '', 'C.G.housing board', '', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(11, 11, '', 'CSIDC', '', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(12, 12, 'नगरीय प्रशासन एवं विकास विभाग', 'अटल नगर विकास प्राधिकरण, रायपुर', 'मुख्य कार्यपालन अधिकारी /1011000356', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(13, 13, 'राजस्व एवं आपदा प्रबंधन विभाग', 'अनुविभागीय अधिकारी तिल्दा-नेवरा, रायपुर', 'अनुविभागीय अधिकारी /2211000002', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(14, 14, 'राजस्व एवं आपदा प्रबंधन विभाग', 'तहसील कार्यालय, तिल्दा', 'तहसीलदार/1011000269', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(15, 15, 'स्कूल शिक्षा विभाग', 'शिक्षा जिला, रायपुर', 'जिला शिक्षा अधिकारी /1011000300', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(16, 16, 'समाज कल्याण विभाग ', 'जिला कार्यालय समाज कल्याण', 'संयुक्त संचालक/1711000053', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(17, 17, 'राजस्व एवं आपदा प्रबंधन विभाग', 'तहसील कार्यालय, अभनपुर', 'तहसीलदार/1011000271', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(18, 18, 'लोक स्वास्थ्य, परिवार कल्याण एवं चिकित्सा शिक्षा विभाग', 'जिला आयुष रायपुर', 'जिला आयुर्वेद अधिकारी/2511000007', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(19, 19, 'पंचायत एवं ग्रामीण विकास विभाग', 'जनपद पंचायत, आरंग', 'मुख्य कार्यपालन अधिकारी /1011000254', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(20, 20, 'श्रम विभाग', 'श्रम विभाग, रायपुर', 'सहायक आयुक्त /1011000355', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(21, 21, 'नगरीय प्रशासन एवं विकास विभाग', 'नगर पालिका परिषद् , तिल्दानेवारा', 'मुख्य नगर पालिका अधिकारी /1111000465', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(22, 22, 'खाद्य नागरिक आपूर्ति एवं उपभोक्ता संरक्षण विभाग', 'जिला खाद्य नियंत्रक , रायपुर', 'खादय नियंत्रक/1011000299', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(23, 23, 'लोक स्वास्थ्य, परिवार कल्याण एवं चिकित्सा शिक्षा विभाग', 'कार्यालय मुख्य चिकित्सा एवं स्वास्थ्य अधिकारी, रायपुर', 'मुख्य चिकित्सा एवं स्वास्थ अधिकारी /1011000318', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(24, 24, 'सार्वजनिक उपक्रम विभाग', 'Lead Bank Manager', 'प्रबंध संचालक /1711000059', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(25, 25, 'वाणिज्य और उद्योग विभाग', 'जिला उद्योग केंद्र, रायपुर', 'महाप्रबंधक /1011000313', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(26, 26, 'आदिम जाति तथा अनुसूचित जाति, पिछड़ा वर्ग एवं अल्पसंख्यक विकास विभाग', 'आदिवासी विकास, रायपुर', 'सहायक आयुक्त /1011000283', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(27, 27, 'वन एवं जलवायु परिवर्तन विभाग', 'रायपुर वनमंडल, रायपुर', 'वन मण्डलाधिकारी /1011000331', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(28, 28, 'उच्च शिक्षा विभाग', 'पं.रविशंकर शुक्ल विश्वविद्यालय', 'कुलपति /1011000234', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(29, 29, 'सहकारिता विभाग', 'उप आयुक्‍त सहकारिता एवं उप पंजीयक सहकारी संस्थाएं, रायपुर', 'उप पंजीयक /1011000295', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(30, 30, 'वित्त विभाग', 'वित्त शाखा, जिला कार्यालय, रायपुर', 'प्रभारी अधिकारी/1011000290', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(31, 31, 'पंचायत एवं ग्रामीण विकास विभाग', 'जिला पंचायत', 'मुख्य कार्यपालन अधिकारी /1011000213', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(32, 32, 'नगरीय प्रशासन एवं विकास विभाग', 'नगर निगम, बीरगांव', 'आयुक्त /1011000320', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(33, 33, 'वाणिज्यिक कर विभाग', 'कार्यालय जिला पंजीयक, रायपुर', 'जिला पंजीयक /1011000349', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(34, 34, 'परिवहन विभाग', 'RTO OFFICE', 'क्षेत्रिय परिवहन अधिकारी/1711000057', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(35, 35, 'वन एवं जलवायु परिवर्तन विभाग', 'वन संरक्षक, वन प्रबंधन सूचना प्रणाली, रायपुर', 'वन मण्डलाधिकारी /1011000334', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(36, 36, 'जल संसाधन विभाग', 'मुख्य अभियंता महानदी परियोजना ,जल संसाधन विभाग', 'मुख्य अभियंता /1011000052', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(37, 37, 'लोक निर्माण विभाग', 'लोक निर्माण विभाग, क्रमांक 2', 'कार्यपालन यंत्री /1011000285', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(38, 38, 'वन एवं जलवायु परिवर्तन विभाग', 'जंगल सफारी वनमंडल, रायपुर', 'वन मण्डलाधिकारी /1011000332', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(39, 39, 'पंचायत एवं ग्रामीण विकास विभाग', 'जनपद पंचायत, अभनपुर', 'मुख्य कार्यपालन अधिकारी /1011000255', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(40, 40, 'मछ्ली पालन विभाग', 'मत्स्य विभाग, रायपुर', 'उप संचालक/1011000354', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(41, 41, 'राजस्व एवं आपदा प्रबंधन विभाग', 'तहसील धरसींवा, रायपुर', 'अतिरिक्त तहसीलदार /1011000316', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(42, 42, 'राजस्व एवं आपदा प्रबंधन विभाग', 'भू आबंटन शाखा', 'प्रभारी अधिकारी/2211000004', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(43, 43, 'राजस्व एवं आपदा प्रबंधन विभाग', 'तहसील मंदिर हसोद', 'अतिरिक्त तहसीलदार /1611000004', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(44, 44, 'सहकारिता विभाग', 'जिला सहकारी केंद्रीय बैंक मर्यादित, रायपुर', 'महाप्रबंधक /1011000341', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(45, 45, 'वाणिज्यिक कर विभाग', 'आबकारी, रायपुर', 'सहायक आयुक्त /1011000282', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(46, 46, 'वाणिज्यिक कर विभाग', 'आबकारी, रायपुर', 'उपायुक्त/1211000024', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(47, 47, 'नगरीय प्रशासन एवं विकास विभाग', 'नगर पंचायत, माना', 'मुख्य नगर पालिका अधिकारी /1111000515', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(48, 48, 'नगरीय प्रशासन एवं विकास विभाग', 'नगर पालिका परिषद, अभनपुर, रायपुर', 'मुख्य नगर पालिका अधिकारी /1011000324', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(49, 49, 'लोक निर्माण विभाग', 'परियोजना प्रबंधक ADB Project', 'परियोजना प्रबंधक/1811000003', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(50, 50, 'महिला एवं बाल विकास विभाग', 'महिला एवं बाल विकास विभाग, रायपुर', 'जिला महिला एवं बाल विकास अधिकारी/1011000308', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(51, 51, 'कृषि विभाग', 'कृषि विभाग, रायपुर', 'उप संचालक/1011000309', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(52, 52, 'उच्च शिक्षा विभाग', 'पं.रविशंकर शुक्ल विश्वविद्यालय', 'कुलपति /1911000032', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(53, 53, 'पशुपालन विभाग', 'पशु चिकित्सा एवं स्वास्थ्य सेवाए, रायपुर', 'उप संचालक/1011000307', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(54, 54, 'खनिज साधन विभाग', 'खनिज शाखा', 'उप संचालक/1011000297', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(55, 55, 'ऊर्जा विभाग', 'ØsMk', '', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(56, 56, 'नगरीय प्रशासन एवं विकास विभाग', 'नगर पालिका परिषद् , गोबरानवापारा', 'मुख्य नगर पालिका अधिकारी /1111000475', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(57, 57, 'विज्ञान और प्रोद्योगिकी विभाग', 'CHIPS district Centre', 'प्रबंधक /1711000040', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(58, 58, 'नगरीय प्रशासन एवं विकास विभाग', 'नगर पंचायत, आरंग', 'मुख्य नगर पालिका अधिकारी /1011000327', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(59, 59, 'आवास एवं पर्यावरण विभाग', 'पर्यावरण विभाग रायपुर', 'प्रभारी अधिकारी/1911000001', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(60, 60, 'राजस्व एवं आपदा प्रबंधन विभाग', 'तहसील कार्यालय, आरंग', 'तहसीलदार/1011000270', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(61, 61, 'वन एवं जलवायु परिवर्तन विभाग', 'मुख्य वन संरक्षक, रायपुर वृत्त', 'मुख्य वन संरक्षक /1711000020', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(62, 62, 'सामान्य प्रशासन', 'प्रभारी अधिकारी स्वतंत्रता संग्राम अधिकारी शाखा', 'प्रभारी अधिकारी/1611000005', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(63, 63, 'नगरीय प्रशासन एवं विकास विभाग', 'नगर पालिका परिषद, अभनपुर, रायपुर', 'मुख्य नगर पालिका अधिकारी /1011000325', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(64, 64, 'विज्ञान और प्रोद्योगिकी विभाग', 'CHIPS district Centre', 'EDM /1711000039', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(65, 65, 'समाज कल्याण विभाग ', 'छ.ग. समाज कल्‍याण बोर्ड', 'अध्यक्ष /1911000016', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(66, 66, 'सामान्य प्रशासन', 'कार्यालय अतिरिक्त जिला दण्डाधिकारी, रायपुर', 'अतिरिक्‍त जिला दण्‍डाधिकारी /1011000348', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(67, 67, 'लोक निर्माण विभाग', 'लोक निर्माण विभाग रायपुर', 'मुख्य अभियंता /1011000226', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(68, 68, 'पशुपालन विभाग', 'पशु चिकित्सा एवं स्वास्थ्य सेवाए, रायपुर', 'संयुक्त संचालक/1211000013', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(69, 69, 'सहकारिता विभाग', 'जिला सहकारी केंद्रीय बैंक मर्यादित, रायपुर', 'महाप्रबंधक /1011000341', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(70, 70, 'पशुपालन विभाग', 'छत्तीसगढ़ राज्य पशुधन विकास अभिकरण', 'मुख्य कार्यपालन अधिकारी /1511000014', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(71, 71, 'लोक स्वास्थ्य यांत्रिकी विभाग', 'Karya Palan Yantri, PHE Department, District Office Raipur', 'कार्यपालन यंत्री /1011000060', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(72, 72, 'लोक स्वास्थ्य यांत्रिकी विभाग', 'लोक स्वास्थ्य यांत्रिकी विभाग, रायपुर', 'कार्यपालन यंत्री /1011000338', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(73, 73, 'नगरीय प्रशासन एवं विकास विभाग', 'मुख्य नगर पालिका अधिकारी ,नगर पंचायत कूरा', 'मुख्य नगर पंचायत अधिकारी/1611000003', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(74, 74, 'राजस्व एवं आपदा प्रबंधन विभाग', 'भाड़ा नियंत्रक', '', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(75, 75, 'पंचायत एवं ग्रामीण विकास विभाग', 'जनपद पंचायत, धरसींवा', 'मुख्य कार्यपालन अधिकारी /1011000267', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(76, 76, 'लोक निर्माण विभाग', 'लोक निर्माण विभाग (NH), रायपुर', 'कार्यपालन अभियंता/1911000071', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(77, 77, 'राजस्व एवं आपदा प्रबंधन विभाग', 'नजूल शाखा, जिला कार्यालय, रायपुर', 'नजूल अधिकारी/1011000296', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(78, 78, 'राजस्व एवं आपदा प्रबंधन विभाग', 'तहसील कार्यालय, खरोरा, रायपुर', 'तहसीलदार/2311000004', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(79, 79, 'राजस्व एवं आपदा प्रबंधन विभाग', 'हिन्दी अभिलेख शाखा, जिला कार्यालय रायपुर', 'प्रभारी अधिकारी/1011000357', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(80, 80, 'वाणिज्य और उद्योग विभाग', 'जिला उद्योग केंद्र, रायपुर', 'प्रबंधक /1111000504', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(81, 81, 'आदिम जाति तथा अनुसूचित जाति, पिछड़ा वर्ग एवं अल्पसंख्यक विकास विभाग', 'जिला अंतत्यवसायी विकास, रायपुर', 'मुख्य कार्यपालन अधिकारी /1011000339', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(82, 82, 'आदिम जाति तथा अनुसूचित जाति, पिछड़ा वर्ग एवं अल्पसंख्यक विकास विभाग', 'मध्य क्षेत्र आदिवासी विकास प्राधिकरण', 'सदस्य सचिव एवं आयुक्त/1911000074', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(83, 83, 'आवास एवं पर्यावरण विभाग', 'छ.ग. भू-संपदा विनियामक प्राधिकरण (रेरा)', 'अध्यक्ष /1911000020', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(84, 84, 'आवास एवं पर्यावरण विभाग', 'छ.ग. भाड़ा नियंत्रण अधिकरण', 'अध्यक्ष /1911000019', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(85, 85, 'आवास एवं पर्यावरण विभाग', 'संयुक्त संचालक', 'संयुक्त संचालक/1711000041', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(86, 86, 'उच्च शिक्षा विभाग', 'अटल बिहारी बाजपेयी विश्‍वविद्यालय', 'कुलपति /1911000044', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(87, 87, 'उच्च शिक्षा विभाग', 'अटल बिहारी बाजपेयी विश्‍वविद्यालय', 'कुलसचिव /1911000045', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(88, 88, 'उच्च शिक्षा विभाग', 'इंदिरा कला संगीत विश्‍वविद्यालय', 'कुलपति /1911000034', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(89, 89, 'उच्च शिक्षा विभाग', 'इंदिरा कला संगीत विश्‍वविद्यालय', 'कुलसचिव /1911000035', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(90, 90, 'उच्च शिक्षा विभाग', 'कुशाभाऊ ठकारे पत्रकारिता विश्‍वविद्यालय', 'कुलपति /1911000036', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(91, 91, 'उच्च शिक्षा विभाग', 'कुशाभाऊ ठकारे पत्रकारिता विश्‍वविद्यालय', 'कुलसचिव /1911000037', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(92, 92, 'उच्च शिक्षा विभाग', 'पं. दीनदयाल उपाध्‍याय स्‍मृति स्‍वास्‍थ्‍य, विज्ञान एवं आयुष विश्‍वविद्यालय', 'कुलपति /1911000066', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(93, 93, 'उच्च शिक्षा विभाग', 'पं. सुन्‍दर लाल शर्मा (मुक्‍त) विश्‍वविद्यालय', 'कुलपति /1911000038', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(94, 94, 'उच्च शिक्षा विभाग', 'पं. सुन्‍दर लाल शर्मा (मुक्‍त) विश्‍वविद्यालय', 'कुलसचिव /1911000039', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(95, 95, 'उच्च शिक्षा विभाग', 'पं.रविशंकर शुक्ल विश्वविद्यालय', 'कुलसचिव /1911000033', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(96, 96, 'उच्च शिक्षा विभाग', 'बस्‍तर विश्‍वविद्यालय', 'कुलसचिव /1911000041', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(97, 97, 'उच्च शिक्षा विभाग', 'सत गहिरा गुरू विश्‍वविद्यालय', 'कुलसचिव /1911000043', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(98, 98, 'उच्च शिक्षा विभाग', 'हेमचंद यादव विश्‍वविद्यालय', 'कुलपति /1911000046', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(99, 99, 'उच्च शिक्षा विभाग', 'हेमचंद यादव विश्‍वविद्यालय', 'कुलसचिव /1911000047', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(100, 100, 'उद्यानिकी विभाग', 'उद्यानिकी, रायपुर', 'उप संचालक/1011000315', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(101, 101, 'कृषि विभाग', 'कृषि संभागीय कार्यालय', 'संयुक्त संचालक/1611000016', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(102, 102, 'कृषि विभाग', 'बीज प्रमाणीकरण संस्था रायपुर', 'प्रबंध संचालक /1811000009', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(103, 103, 'कृषि विभाग', 'संभागीय संयुक्त संचालक कृषि', 'संयुक्त संचालक/1811000010', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(104, 104, 'कौशल विकास, तकनीकी शिक्षा एवं रोजगार विभाग', 'जिला रोजगार कार्यालय', 'जिला रोजगार अधिकारी/1011000292', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(105, 105, 'खनिज साधन विभाग', 'मिनरल डेव्‍हलपमेंट कार्पोरेशन लिमिटेड', 'अध्यक्ष /1911000012', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(106, 106, 'खेल एवं युवा कल्याण विभाग', 'जिला खेल एवं युवा कल्याण विभाग कार्यालय', 'वरिष्ठ खेल अधिकारी /1111000457', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(107, 107, 'गृह विभाग', 'कार्यालय अतिरिक्‍त पुलिस अधीक्षक, शहर रायपुर', 'अतिरिक्‍त पुलिस अधीक्षक, शहर रायपुर @1011000352', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(108, 108, 'गृह विभाग', 'कार्यालय पुलिस महानिरिक्षक', 'पुलिस महानिरीक्षक /1111000391', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(109, 109, 'गृह विभाग', 'जिला सेनानी नगर सेना माना कैंप रायपुर', 'जिला नगर सेनानी अधिकारी /2411000006', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(110, 110, 'जन शिकायत निवारण विभाग', 'लि-1, जन शिकायत शाखा, जिला कार्यालय, रायपुर', 'प्रभारी अधिकारी/1011000293', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(111, 111, 'जन शिकायत निवारण विभाग', 'लि-5, जन शिकायत शाखा, जिला कार्यालय, रायपुर', 'प्रभारी अधिकारी/1011000294', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(112, 112, 'जनसंपर्क विभाग', 'जिला जनसंपर्क कार्यालय', 'सहायक संचालक/1111000447', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(113, 113, 'जेल विभाग', 'केंद्रीय जेल, रायपुर', 'अधीक्षक /1011000340', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(114, 114, 'जल संसाधन विभाग', 'जल संसाधन विभाग, रायपुर', 'कार्यपालन यंत्री /1011000342', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(115, 115, 'धार्मिक न्यास और धर्मस्व विभाग', 'धार्मिक न्यास और धर्मस्व विभाग रायपुर', 'प्रभारी अधिकारी/2411000004', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(116, 116, 'नगरीय प्रशासन एवं विकास विभाग', 'गोबरा नवापारा-राजिम', 'मुख्य नगर पालिका अधिकारी /1011000304', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(117, 117, 'नगरीय प्रशासन एवं विकास विभाग', 'जिला शहरी विकास अभिकरण, रायपुर', 'परियोजना अधिकारी /1011000312', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(118, 118, 'नगरीय प्रशासन एवं विकास विभाग', 'नगर निगम', 'महापौर /1011000209', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(119, 119, 'नगरीय प्रशासन एवं विकास विभाग', 'नगर पंचायत मंदिर हसौद', 'मुख्य नगर पालिका अधिकारी /2311000002', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(120, 120, 'नगरीय प्रशासन एवं विकास विभाग', 'नगर पंचायत, खरोरा', 'मुख्य नगर पालिका अधिकारी /1111000516', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(121, 121, 'नगरीय प्रशासन एवं विकास विभाग', 'मुख्य नगर पालिका अधिकारी, समोदा', 'मुख्य नगर पालिका अधिकारी /2111000018', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(122, 122, 'नगरीय प्रशासन एवं विकास विभाग', 'मुख्य नगर पालिका अधिकारी, चंदखुरी', 'मुख्य नगर पालिका अधिकारी /2111000019', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(123, 123, 'पंचायत एवं ग्रामीण विकास विभाग', 'ग्रामीण यांत्रिकी सेवा, रायपुर', 'कार्यपालन यंत्री /1011000289', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(124, 124, 'पंचायत एवं ग्रामीण विकास विभाग', 'जनपद पंचायत, तिल्दा', 'मुख्य कार्यपालन अधिकारी /1011000253', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(125, 125, 'पंचायत एवं ग्रामीण विकास विभाग', 'जनपद पंचायत, राजिम', 'मुख्य कार्यपालन अधिकारी /1011000263', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(126, 126, 'पंचायत एवं ग्रामीण विकास विभाग', 'जिला पंचायत', 'मुख्य कार्यपालन अधिकारी /2511000011', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(127, 127, 'पंचायत एवं ग्रामीण विकास विभाग', 'पंचायत संचालनालय, रायपुर', 'उप संचालक/1011000314', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(128, 128, 'पंचायत एवं ग्रामीण विकास विभाग', 'प्रधानमंत्री ग्राम सडक योजना, जिला रायपुर', 'कार्यपालन अभियंता/1011000351', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(129, 129, 'पंचायत एवं ग्रामीण विकास विभाग', 'मुख्यमंत्री ग्राम सड़क योजना', 'कार्यपालन अभियंता/1311000004', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(130, 130, 'पंचायत एवं ग्रामीण विकास विभाग', 'राज्‍य स्‍वच्‍छ भारत मिशन (ग्रामीण)', 'राज्य समन्वयक/1911000002', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(131, 131, 'पशुपालन विभाग', 'छ.ग. राज्‍य जीव जन्‍तु कल्‍याण बोर्ड', 'अध्यक्ष /1911000023', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(132, 132, 'मछ्ली पालन विभाग', 'छ.ग. राज्‍य मत्‍स्‍य महासंघ (सहकारी) मर्यादित', 'अध्यक्ष /1911000024', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(133, 133, 'योजना, आर्थिक और सांख्यिकी विभाग', 'जिला सांख्यकीय अधिकारी', 'जि‍ला योजना एवं सांख्‍यकीय अधि‍कारी /1911000005', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(134, 134, 'राजस्व एवं आपदा प्रबंधन विभाग', 'अपर कलेक्टर 01', 'अपर कलेक्टर/1211000020', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(135, 135, 'राजस्व एवं आपदा प्रबंधन विभाग', 'अपर कलेक्टर 02 निधि साहू', 'अपर कलेक्टर/2411000003', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(136, 136, 'राजस्व एवं आपदा प्रबंधन विभाग', 'तहसील कार्यालय, खरोरा, रायपुर', 'अतिरिक्त तहसीलदार /1011000317', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(137, 137, 'राजस्व एवं आपदा प्रबंधन विभाग', 'तहसीलदार नजूल शाखा, जिला कार्यालय, रायपुर', 'तहसीलदार/1011000322', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(138, 138, 'राजस्व एवं आपदा प्रबंधन विभाग', 'प्रपत्र शाखा कलेक्ट्रेट रायपुर', 'प्रभारी अधिकारी/2311000005', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(139, 139, 'राजस्व एवं आपदा प्रबंधन विभाग', 'भू अर्जन, शाखा, जिला कार्यालय, रायपुर', 'प्रभारी अधिकारी/1011000347', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(140, 140, 'राजस्व एवं आपदा प्रबंधन विभाग', 'भु-अभिलेख, रायपुर', 'अधीक्षक /1011000288', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(141, 141, 'राजस्व एवं आपदा प्रबंधन विभाग', 'वरिष्ठ लिपिक शाखा', 'प्रभारी अधिकारी/1111000547', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(142, 142, 'राजस्व एवं आपदा प्रबंधन विभाग', 'वाचक शाखा', 'प्रभारी अधिकारी/1111000548', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(143, 143, 'राजस्व एवं आपदा प्रबंधन विभाग', 'सहायक अधीक्षक(राजस्व), कार्यालय कलेक्टर, रायपुर', 'प्रभारी अधिकारी/1011000329', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(144, 144, 'लोक निर्माण विभाग', 'लोक निर्माण विभाग (E & M) रायपुर', 'कार्यपालन अभियंता/1911000006', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(145, 145, 'लोक निर्माण विभाग', 'लोक निर्माण विभाग, क्रमांक 1', 'कार्यपालन यंत्री /1011000284', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(146, 146, 'लोक निर्माण विभाग', 'लोक निर्माण विभाग, क्रमांक 3', 'कार्यपालन यंत्री /1011000286', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(147, 147, 'लोक निर्माण विभाग', 'लोक निर्माण विभाग, विधानसभा संभाग्', 'कार्यपालन यंत्री /1011000287', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(148, 148, 'लोक निर्माण विभाग', 'लोक निर्माण विभाग, विधानसभा संभाग्', 'कार्यपालन यंत्री /1011000287', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(149, 149, 'लोक निर्माण विभाग', 'सेतु संभाग लोक निर्माण विभाग', 'कार्यपालन अभियंता/2411000002', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(150, 150, 'लोक स्वास्थ्य यांत्रिकी विभाग', 'Mukhya Abhiyanta, PHE Department, District Office Raipur', 'मुख्य अभियंता /1011000061', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(151, 151, 'लोक स्वास्थ्य, परिवार कल्याण एवं चिकित्सा शिक्षा विभाग', 'जिला चिकित्सालय, रायपुर', 'जिला मलेरिया अधिकारी/1211000025', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(152, 152, 'लोक स्वास्थ्य, परिवार कल्याण एवं चिकित्सा शिक्षा विभाग', 'जिला चिकित्सालय, रायपुर', 'सिविल सर्जन/1011000303', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(153, 153, 'वन एवं जलवायु परिवर्तन विभाग', 'उदन्ती वनमंडल, गरियाबंद', 'वन मण्डलाधिकारी /1011000335', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(154, 154, 'वन एवं जलवायु परिवर्तन विभाग', 'वन अनुसंधान एवं विस्तार वनमंडल, रायपुर', 'वन मण्डलाधिकारी /1011000333', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(155, 155, 'वाणिज्य और उद्योग विभाग', 'जिला उद्योग केंद्र, रायपुर', 'मुख्य महाप्रबंधक /1111000502', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(156, 156, 'वाणिज्यिक कर विभाग', 'स्‍टेट मार्केटिंग कार्पोरेशन', 'अध्यक्ष /1911000010', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(157, 157, 'वित्त विभाग', 'District Treasury Raipur', 'जिला कोषालय अधिकारी /1511000008', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(158, 158, 'वित्त विभाग', 'संयुक्‍त संचालक कोष लेखा पेंशन,', 'संभागीय संयुक्‍त संचालक/2311000007', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(159, 159, 'विधि और विधायी कार्य विभाग', 'जिला उपभोक्ता फोरम', 'अध्यक्ष /2211000003', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(160, 160, 'श्रम विभाग', 'उप संचालक औद्योगिक स्वास्थ्य एवं सुरक्षा रायपुर, जिला रायपुर', 'उप संचालक/2511000016', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(161, 161, 'श्रम विभाग', 'बालश्रम परियोजना, जिला कार्यालय, रायपुर', '', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(162, 162, 'स्कूल शिक्षा विभाग', 'Rajiv Gandhi Siksha Mission', 'उप संचालक/1211000016', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(163, 163, 'सुशासन एवं अभिसरण', 'सुशासन एवं अभिसरण', 'अवर सचिव /2511000013', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(164, 164, 'संस्कृति विभाग', 'छ.ग. सिंधी अकादमी', 'अध्यक्ष /1911000018', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(165, 165, 'संस्कृति विभाग', 'पदुमलाल पुन्‍नालाल बख्‍शी सृजनपीठ', 'अध्यक्ष /1911000017', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(166, 166, 'सहकारिता विभाग', 'छत्‍तीसगढ राज्‍य सहकारी विपणन संघ मर्यादित, जिला रायपुर', 'जिला विपणन अधिकारी/1211000017', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(167, 167, 'सहकारिता विभाग', 'छत्‍तीसगढ राज्‍य सहकारी विपणन संघ मर्यादित, जिला रायपुर', 'राज्य विपणन अधिकारी/1211000026', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(168, 168, 'सहकारिता विभाग', 'संयुक्‍त आयुक्‍त सहकारिता एवं संयुक्‍त पंजीयक सहकारी संस्‍थाएं, रायपुर', 'संयुक्त पंजीयक/1711000063', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(169, 169, 'सहकारिता विभाग', 'सहकारिता विभाग जिला विभाग', 'महानिदेशक /1011000163', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(170, 170, 'सामान्य प्रशासन', 'Collector Office Raipur', 'कलेक्टर /1011000016', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(171, 171, 'सामान्य प्रशासन', 'District Administration-Raipur', 'Admin/2311000001', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(172, 172, 'सामान्य प्रशासन', 'आयुक्त कार्यालय', 'आयुक्त /1211000023', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(173, 173, 'सामान्य प्रशासन', 'जिला निवार्चन, रायपुर', 'उप जिला निर्वाचन अधिकारी /1011000302', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(174, 174, 'सामान्य प्रशासन', 'स्थानीय निर्वाचन शाखा, रायपुर', 'प्रभारी अधिकारी/1011000344', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(175, 175, 'सार्वजनिक उपक्रम विभाग', 'BSNL', 'प्रभारी अधिकारी/1711000051', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(176, 176, 'सार्वजनिक उपक्रम विभाग', 'National Highway', 'कार्यपालन अभियंता/1211000022', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(177, 177, 'सार्वजनिक उपक्रम विभाग', 'Post Master General', 'मुख्य पोस्ट मास्टर /1211000019', 0, 0, 0, 0, 0, 0, 0, '2025-08-08 00:00:00'),
	(256, 1, 'नगरीय प्रशासन एवं विकास विभाग', 'नगर निगम', 'आयुक्त /1011000208', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(257, 2, 'गृह विभाग', 'वरिष्ठ पुलिस अधीक्षक कार्यालय', 'वरिष्ठ पुलिस अधीक्षक /1011000301', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(258, 3, 'राजस्व एवं आपदा प्रबंधन विभाग', 'अनुविभागीय अधिकारी , रायपुर्', 'अनुविभागीय अधिकारी /1011000246', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(259, 4, 'राजस्व एवं आपदा प्रबंधन विभाग', 'अनुविभागीय अधिकारी आरंग', 'अनुविभागीय अधिकारी /1611000009', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(260, 5, 'राजस्व एवं आपदा प्रबंधन विभाग', 'तहसील कार्यालय, रायपुर', 'तहसीलदार/1011000274', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(261, 6, 'राजस्व एवं आपदा प्रबंधन विभाग', 'अनुविभागीय अधिकारी अभनपुर', 'अनुविभागीय अधिकारी /1011000291', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(262, 7, 'ऊर्जा विभाग', 'छत्तीसगढ़ राज्य विद्युत वितरण कंपनी लिमि', 'कार्यपालन यंत्री /1011000197', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(263, 8, 'राजस्व एवं आपदा प्रबंधन विभाग', 'तहसील गोबरा नवापारा', 'तहसीलदार/2311000003', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(264, 9, 'नगरीय प्रशासन एवं विकास विभाग', 'रायपुर विकास प्राधिकरण, रायपुर', 'मुख्य कार्यपालन अधिकारी /1011000319', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(265, 10, '', 'C.G.housing board', '', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(266, 11, '', 'CSIDC', '', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(267, 12, 'नगरीय प्रशासन एवं विकास विभाग', 'अटल नगर विकास प्राधिकरण, रायपुर', 'मुख्य कार्यपालन अधिकारी /1011000356', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(268, 13, 'राजस्व एवं आपदा प्रबंधन विभाग', 'अनुविभागीय अधिकारी तिल्दा-नेवरा, रायपुर', 'अनुविभागीय अधिकारी /2211000002', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(269, 14, 'राजस्व एवं आपदा प्रबंधन विभाग', 'तहसील कार्यालय, तिल्दा', 'तहसीलदार/1011000269', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(270, 15, 'स्कूल शिक्षा विभाग', 'शिक्षा जिला, रायपुर', 'जिला शिक्षा अधिकारी /1011000300', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(271, 16, 'समाज कल्याण विभाग ', 'जिला कार्यालय समाज कल्याण', 'संयुक्त संचालक/1711000053', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(272, 17, 'राजस्व एवं आपदा प्रबंधन विभाग', 'तहसील कार्यालय, अभनपुर', 'तहसीलदार/1011000271', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(273, 18, 'लोक स्वास्थ्य, परिवार कल्याण एवं चिकित्सा शिक्षा विभाग', 'जिला आयुष रायपुर', 'जिला आयुर्वेद अधिकारी/2511000007', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(274, 19, 'पंचायत एवं ग्रामीण विकास विभाग', 'जनपद पंचायत, आरंग', 'मुख्य कार्यपालन अधिकारी /1011000254', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(275, 20, 'श्रम विभाग', 'श्रम विभाग, रायपुर', 'सहायक आयुक्त /1011000355', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(276, 21, 'नगरीय प्रशासन एवं विकास विभाग', 'नगर पालिका परिषद् , तिल्दानेवारा', 'मुख्य नगर पालिका अधिकारी /1111000465', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(277, 22, 'खाद्य नागरिक आपूर्ति एवं उपभोक्ता संरक्षण विभाग', 'जिला खाद्य नियंत्रक , रायपुर', 'खादय नियंत्रक/1011000299', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(278, 23, 'लोक स्वास्थ्य, परिवार कल्याण एवं चिकित्सा शिक्षा विभाग', 'कार्यालय मुख्य चिकित्सा एवं स्वास्थ्य अधिकारी, रायपुर', 'मुख्य चिकित्सा एवं स्वास्थ अधिकारी /1011000318', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(279, 24, 'सार्वजनिक उपक्रम विभाग', 'Lead Bank Manager', 'प्रबंध संचालक /1711000059', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(280, 25, 'वाणिज्य और उद्योग विभाग', 'जिला उद्योग केंद्र, रायपुर', 'महाप्रबंधक /1011000313', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(281, 26, 'आदिम जाति तथा अनुसूचित जाति, पिछड़ा वर्ग एवं अल्पसंख्यक विकास विभाग', 'आदिवासी विकास, रायपुर', 'सहायक आयुक्त /1011000283', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(282, 27, 'वन एवं जलवायु परिवर्तन विभाग', 'रायपुर वनमंडल, रायपुर', 'वन मण्डलाधिकारी /1011000331', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(283, 28, 'उच्च शिक्षा विभाग', 'पं.रविशंकर शुक्ल विश्वविद्यालय', 'कुलपति /1011000234', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(284, 29, 'सहकारिता विभाग', 'उप आयुक्‍त सहकारिता एवं उप पंजीयक सहकारी संस्थाएं, रायपुर', 'उप पंजीयक /1011000295', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(285, 30, 'वित्त विभाग', 'वित्त शाखा, जिला कार्यालय, रायपुर', 'प्रभारी अधिकारी/1011000290', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(286, 31, 'पंचायत एवं ग्रामीण विकास विभाग', 'जिला पंचायत', 'मुख्य कार्यपालन अधिकारी /1011000213', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(287, 32, 'नगरीय प्रशासन एवं विकास विभाग', 'नगर निगम, बीरगांव', 'आयुक्त /1011000320', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(288, 33, 'वाणिज्यिक कर विभाग', 'कार्यालय जिला पंजीयक, रायपुर', 'जिला पंजीयक /1011000349', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(289, 34, 'परिवहन विभाग', 'RTO OFFICE', 'क्षेत्रिय परिवहन अधिकारी/1711000057', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(290, 35, 'वन एवं जलवायु परिवर्तन विभाग', 'वन संरक्षक, वन प्रबंधन सूचना प्रणाली, रायपुर', 'वन मण्डलाधिकारी /1011000334', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(291, 36, 'जल संसाधन विभाग', 'मुख्य अभियंता महानदी परियोजना ,जल संसाधन विभाग', 'मुख्य अभियंता /1011000052', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(292, 37, 'लोक निर्माण विभाग', 'लोक निर्माण विभाग, क्रमांक 2', 'कार्यपालन यंत्री /1011000285', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(293, 38, 'वन एवं जलवायु परिवर्तन विभाग', 'जंगल सफारी वनमंडल, रायपुर', 'वन मण्डलाधिकारी /1011000332', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(294, 39, 'पंचायत एवं ग्रामीण विकास विभाग', 'जनपद पंचायत, अभनपुर', 'मुख्य कार्यपालन अधिकारी /1011000255', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(295, 40, 'मछ्ली पालन विभाग', 'मत्स्य विभाग, रायपुर', 'उप संचालक/1011000354', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(296, 41, 'राजस्व एवं आपदा प्रबंधन विभाग', 'तहसील धरसींवा, रायपुर', 'अतिरिक्त तहसीलदार /1011000316', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(297, 42, 'राजस्व एवं आपदा प्रबंधन विभाग', 'भू आबंटन शाखा', 'प्रभारी अधिकारी/2211000004', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(298, 43, 'राजस्व एवं आपदा प्रबंधन विभाग', 'तहसील मंदिर हसोद', 'अतिरिक्त तहसीलदार /1611000004', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(299, 44, 'सहकारिता विभाग', 'जिला सहकारी केंद्रीय बैंक मर्यादित, रायपुर', 'महाप्रबंधक /1011000341', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(300, 45, 'वाणिज्यिक कर विभाग', 'आबकारी, रायपुर', 'सहायक आयुक्त /1011000282', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(301, 46, 'वाणिज्यिक कर विभाग', 'आबकारी, रायपुर', 'उपायुक्त/1211000024', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(302, 47, 'नगरीय प्रशासन एवं विकास विभाग', 'नगर पंचायत, माना', 'मुख्य नगर पालिका अधिकारी /1111000515', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(303, 48, 'नगरीय प्रशासन एवं विकास विभाग', 'नगर पालिका परिषद, अभनपुर, रायपुर', 'मुख्य नगर पालिका अधिकारी /1011000324', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(304, 49, 'लोक निर्माण विभाग', 'परियोजना प्रबंधक ADB Project', 'परियोजना प्रबंधक/1811000003', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(305, 50, 'महिला एवं बाल विकास विभाग', 'महिला एवं बाल विकास विभाग, रायपुर', 'जिला महिला एवं बाल विकास अधिकारी/1011000308', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(306, 51, 'कृषि विभाग', 'कृषि विभाग, रायपुर', 'उप संचालक/1011000309', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(307, 52, 'उच्च शिक्षा विभाग', 'पं.रविशंकर शुक्ल विश्वविद्यालय', 'कुलपति /1911000032', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(308, 53, 'पशुपालन विभाग', 'पशु चिकित्सा एवं स्वास्थ्य सेवाए, रायपुर', 'उप संचालक/1011000307', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(309, 54, 'खनिज साधन विभाग', 'खनिज शाखा', 'उप संचालक/1011000297', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(310, 55, 'ऊर्जा विभाग', 'ØsMk', '', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(311, 56, 'नगरीय प्रशासन एवं विकास विभाग', 'नगर पालिका परिषद् , गोबरानवापारा', 'मुख्य नगर पालिका अधिकारी /1111000475', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(312, 57, 'विज्ञान और प्रोद्योगिकी विभाग', 'CHIPS district Centre', 'प्रबंधक /1711000040', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(313, 58, 'नगरीय प्रशासन एवं विकास विभाग', 'नगर पंचायत, आरंग', 'मुख्य नगर पालिका अधिकारी /1011000327', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(314, 59, 'आवास एवं पर्यावरण विभाग', 'पर्यावरण विभाग रायपुर', 'प्रभारी अधिकारी/1911000001', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(315, 60, 'राजस्व एवं आपदा प्रबंधन विभाग', 'तहसील कार्यालय, आरंग', 'तहसीलदार/1011000270', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(316, 61, 'वन एवं जलवायु परिवर्तन विभाग', 'मुख्य वन संरक्षक, रायपुर वृत्त', 'मुख्य वन संरक्षक /1711000020', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(317, 62, 'सामान्य प्रशासन', 'प्रभारी अधिकारी स्वतंत्रता संग्राम अधिकारी शाखा', 'प्रभारी अधिकारी/1611000005', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(318, 63, 'नगरीय प्रशासन एवं विकास विभाग', 'नगर पालिका परिषद, अभनपुर, रायपुर', 'मुख्य नगर पालिका अधिकारी /1011000325', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(319, 64, 'विज्ञान और प्रोद्योगिकी विभाग', 'CHIPS district Centre', 'EDM /1711000039', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(320, 65, 'समाज कल्याण विभाग ', 'छ.ग. समाज कल्‍याण बोर्ड', 'अध्यक्ष /1911000016', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(321, 66, 'सामान्य प्रशासन', 'कार्यालय अतिरिक्त जिला दण्डाधिकारी, रायपुर', 'अतिरिक्‍त जिला दण्‍डाधिकारी /1011000348', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(322, 67, 'लोक निर्माण विभाग', 'लोक निर्माण विभाग रायपुर', 'मुख्य अभियंता /1011000226', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(323, 68, 'पशुपालन विभाग', 'पशु चिकित्सा एवं स्वास्थ्य सेवाए, रायपुर', 'संयुक्त संचालक/1211000013', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(324, 69, 'सहकारिता विभाग', 'जिला सहकारी केंद्रीय बैंक मर्यादित, रायपुर', 'महाप्रबंधक /1011000341', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(325, 70, 'पशुपालन विभाग', 'छत्तीसगढ़ राज्य पशुधन विकास अभिकरण', 'मुख्य कार्यपालन अधिकारी /1511000014', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(326, 71, 'लोक स्वास्थ्य यांत्रिकी विभाग', 'Karya Palan Yantri, PHE Department, District Office Raipur', 'कार्यपालन यंत्री /1011000060', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(327, 72, 'लोक स्वास्थ्य यांत्रिकी विभाग', 'लोक स्वास्थ्य यांत्रिकी विभाग, रायपुर', 'कार्यपालन यंत्री /1011000338', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(328, 73, 'नगरीय प्रशासन एवं विकास विभाग', 'मुख्य नगर पालिका अधिकारी ,नगर पंचायत कूरा', 'मुख्य नगर पंचायत अधिकारी/1611000003', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(329, 74, 'राजस्व एवं आपदा प्रबंधन विभाग', 'भाड़ा नियंत्रक', '', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(330, 75, 'पंचायत एवं ग्रामीण विकास विभाग', 'जनपद पंचायत, धरसींवा', 'मुख्य कार्यपालन अधिकारी /1011000267', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(331, 76, 'लोक निर्माण विभाग', 'लोक निर्माण विभाग (NH), रायपुर', 'कार्यपालन अभियंता/1911000071', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(332, 77, 'राजस्व एवं आपदा प्रबंधन विभाग', 'नजूल शाखा, जिला कार्यालय, रायपुर', 'नजूल अधिकारी/1011000296', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(333, 78, 'राजस्व एवं आपदा प्रबंधन विभाग', 'तहसील कार्यालय, खरोरा, रायपुर', 'तहसीलदार/2311000004', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(334, 79, 'राजस्व एवं आपदा प्रबंधन विभाग', 'हिन्दी अभिलेख शाखा, जिला कार्यालय रायपुर', 'प्रभारी अधिकारी/1011000357', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(335, 80, 'वाणिज्य और उद्योग विभाग', 'जिला उद्योग केंद्र, रायपुर', 'प्रबंधक /1111000504', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(336, 81, 'आदिम जाति तथा अनुसूचित जाति, पिछड़ा वर्ग एवं अल्पसंख्यक विकास विभाग', 'जिला अंतत्यवसायी विकास, रायपुर', 'मुख्य कार्यपालन अधिकारी /1011000339', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(337, 82, 'आदिम जाति तथा अनुसूचित जाति, पिछड़ा वर्ग एवं अल्पसंख्यक विकास विभाग', 'मध्य क्षेत्र आदिवासी विकास प्राधिकरण', 'सदस्य सचिव एवं आयुक्त/1911000074', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(338, 83, 'आवास एवं पर्यावरण विभाग', 'छ.ग. भू-संपदा विनियामक प्राधिकरण (रेरा)', 'अध्यक्ष /1911000020', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(339, 84, 'आवास एवं पर्यावरण विभाग', 'छ.ग. भाड़ा नियंत्रण अधिकरण', 'अध्यक्ष /1911000019', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(340, 85, 'आवास एवं पर्यावरण विभाग', 'संयुक्त संचालक', 'संयुक्त संचालक/1711000041', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(341, 86, 'उच्च शिक्षा विभाग', 'अटल बिहारी बाजपेयी विश्‍वविद्यालय', 'कुलपति /1911000044', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(342, 87, 'उच्च शिक्षा विभाग', 'अटल बिहारी बाजपेयी विश्‍वविद्यालय', 'कुलसचिव /1911000045', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(343, 88, 'उच्च शिक्षा विभाग', 'इंदिरा कला संगीत विश्‍वविद्यालय', 'कुलपति /1911000034', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(344, 89, 'उच्च शिक्षा विभाग', 'इंदिरा कला संगीत विश्‍वविद्यालय', 'कुलसचिव /1911000035', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(345, 90, 'उच्च शिक्षा विभाग', 'कुशाभाऊ ठकारे पत्रकारिता विश्‍वविद्यालय', 'कुलपति /1911000036', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(346, 91, 'उच्च शिक्षा विभाग', 'कुशाभाऊ ठकारे पत्रकारिता विश्‍वविद्यालय', 'कुलसचिव /1911000037', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(347, 92, 'उच्च शिक्षा विभाग', 'पं. दीनदयाल उपाध्‍याय स्‍मृति स्‍वास्‍थ्‍य, विज्ञान एवं आयुष विश्‍वविद्यालय', 'कुलपति /1911000066', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(348, 93, 'उच्च शिक्षा विभाग', 'पं. सुन्‍दर लाल शर्मा (मुक्‍त) विश्‍वविद्यालय', 'कुलपति /1911000038', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(349, 94, 'उच्च शिक्षा विभाग', 'पं. सुन्‍दर लाल शर्मा (मुक्‍त) विश्‍वविद्यालय', 'कुलसचिव /1911000039', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(350, 95, 'उच्च शिक्षा विभाग', 'पं.रविशंकर शुक्ल विश्वविद्यालय', 'कुलसचिव /1911000033', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(351, 96, 'उच्च शिक्षा विभाग', 'बस्‍तर विश्‍वविद्यालय', 'कुलसचिव /1911000041', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(352, 97, 'उच्च शिक्षा विभाग', 'सत गहिरा गुरू विश्‍वविद्यालय', 'कुलसचिव /1911000043', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(353, 98, 'उच्च शिक्षा विभाग', 'हेमचंद यादव विश्‍वविद्यालय', 'कुलपति /1911000046', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(354, 99, 'उच्च शिक्षा विभाग', 'हेमचंद यादव विश्‍वविद्यालय', 'कुलसचिव /1911000047', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(355, 100, 'उद्यानिकी विभाग', 'उद्यानिकी, रायपुर', 'उप संचालक/1011000315', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(356, 101, 'कृषि विभाग', 'कृषि संभागीय कार्यालय', 'संयुक्त संचालक/1611000016', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(357, 102, 'कृषि विभाग', 'बीज प्रमाणीकरण संस्था रायपुर', 'प्रबंध संचालक /1811000009', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(358, 103, 'कृषि विभाग', 'संभागीय संयुक्त संचालक कृषि', 'संयुक्त संचालक/1811000010', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(359, 104, 'कौशल विकास, तकनीकी शिक्षा एवं रोजगार विभाग', 'जिला रोजगार कार्यालय', 'जिला रोजगार अधिकारी/1011000292', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(360, 105, 'खनिज साधन विभाग', 'मिनरल डेव्‍हलपमेंट कार्पोरेशन लिमिटेड', 'अध्यक्ष /1911000012', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(361, 106, 'खेल एवं युवा कल्याण विभाग', 'जिला खेल एवं युवा कल्याण विभाग कार्यालय', 'वरिष्ठ खेल अधिकारी /1111000457', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(362, 107, 'गृह विभाग', 'कार्यालय अतिरिक्‍त पुलिस अधीक्षक, शहर रायपुर', 'अतिरिक्‍त पुलिस अधीक्षक, शहर रायपुर @1011000352', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(363, 108, 'गृह विभाग', 'कार्यालय पुलिस महानिरिक्षक', 'पुलिस महानिरीक्षक /1111000391', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(364, 109, 'गृह विभाग', 'जिला सेनानी नगर सेना माना कैंप रायपुर', 'जिला नगर सेनानी अधिकारी /2411000006', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(365, 110, 'जन शिकायत निवारण विभाग', 'लि-1, जन शिकायत शाखा, जिला कार्यालय, रायपुर', 'प्रभारी अधिकारी/1011000293', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(366, 111, 'जन शिकायत निवारण विभाग', 'लि-5, जन शिकायत शाखा, जिला कार्यालय, रायपुर', 'प्रभारी अधिकारी/1011000294', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(367, 112, 'जनसंपर्क विभाग', 'जिला जनसंपर्क कार्यालय', 'सहायक संचालक/1111000447', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(368, 113, 'जेल विभाग', 'केंद्रीय जेल, रायपुर', 'अधीक्षक /1011000340', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(369, 114, 'जल संसाधन विभाग', 'जल संसाधन विभाग, रायपुर', 'कार्यपालन यंत्री /1011000342', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(370, 115, 'धार्मिक न्यास और धर्मस्व विभाग', 'धार्मिक न्यास और धर्मस्व विभाग रायपुर', 'प्रभारी अधिकारी/2411000004', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(371, 116, 'नगरीय प्रशासन एवं विकास विभाग', 'गोबरा नवापारा-राजिम', 'मुख्य नगर पालिका अधिकारी /1011000304', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(372, 117, 'नगरीय प्रशासन एवं विकास विभाग', 'जिला शहरी विकास अभिकरण, रायपुर', 'परियोजना अधिकारी /1011000312', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(373, 118, 'नगरीय प्रशासन एवं विकास विभाग', 'नगर निगम', 'महापौर /1011000209', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(374, 119, 'नगरीय प्रशासन एवं विकास विभाग', 'नगर पंचायत मंदिर हसौद', 'मुख्य नगर पालिका अधिकारी /2311000002', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(375, 120, 'नगरीय प्रशासन एवं विकास विभाग', 'नगर पंचायत, खरोरा', 'मुख्य नगर पालिका अधिकारी /1111000516', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(376, 121, 'नगरीय प्रशासन एवं विकास विभाग', 'मुख्य नगर पालिका अधिकारी, समोदा', 'मुख्य नगर पालिका अधिकारी /2111000018', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(377, 122, 'नगरीय प्रशासन एवं विकास विभाग', 'मुख्य नगर पालिका अधिकारी, चंदखुरी', 'मुख्य नगर पालिका अधिकारी /2111000019', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(378, 123, 'पंचायत एवं ग्रामीण विकास विभाग', 'ग्रामीण यांत्रिकी सेवा, रायपुर', 'कार्यपालन यंत्री /1011000289', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(379, 124, 'पंचायत एवं ग्रामीण विकास विभाग', 'जनपद पंचायत, तिल्दा', 'मुख्य कार्यपालन अधिकारी /1011000253', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(380, 125, 'पंचायत एवं ग्रामीण विकास विभाग', 'जनपद पंचायत, राजिम', 'मुख्य कार्यपालन अधिकारी /1011000263', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(381, 126, 'पंचायत एवं ग्रामीण विकास विभाग', 'जिला पंचायत', 'मुख्य कार्यपालन अधिकारी /2511000011', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(382, 127, 'पंचायत एवं ग्रामीण विकास विभाग', 'पंचायत संचालनालय, रायपुर', 'उप संचालक/1011000314', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(383, 128, 'पंचायत एवं ग्रामीण विकास विभाग', 'प्रधानमंत्री ग्राम सडक योजना, जिला रायपुर', 'कार्यपालन अभियंता/1011000351', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(384, 129, 'पंचायत एवं ग्रामीण विकास विभाग', 'मुख्यमंत्री ग्राम सड़क योजना', 'कार्यपालन अभियंता/1311000004', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(385, 130, 'पंचायत एवं ग्रामीण विकास विभाग', 'राज्‍य स्‍वच्‍छ भारत मिशन (ग्रामीण)', 'राज्य समन्वयक/1911000002', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(386, 131, 'पशुपालन विभाग', 'छ.ग. राज्‍य जीव जन्‍तु कल्‍याण बोर्ड', 'अध्यक्ष /1911000023', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(387, 132, 'मछ्ली पालन विभाग', 'छ.ग. राज्‍य मत्‍स्‍य महासंघ (सहकारी) मर्यादित', 'अध्यक्ष /1911000024', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(388, 133, 'योजना, आर्थिक और सांख्यिकी विभाग', 'जिला सांख्यकीय अधिकारी', 'जि‍ला योजना एवं सांख्‍यकीय अधि‍कारी /1911000005', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(389, 134, 'राजस्व एवं आपदा प्रबंधन विभाग', 'अपर कलेक्टर 01', 'अपर कलेक्टर/1211000020', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(390, 135, 'राजस्व एवं आपदा प्रबंधन विभाग', 'अपर कलेक्टर 02 निधि साहू', 'अपर कलेक्टर/2411000003', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(391, 136, 'राजस्व एवं आपदा प्रबंधन विभाग', 'तहसील कार्यालय, खरोरा, रायपुर', 'अतिरिक्त तहसीलदार /1011000317', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(392, 137, 'राजस्व एवं आपदा प्रबंधन विभाग', 'तहसीलदार नजूल शाखा, जिला कार्यालय, रायपुर', 'तहसीलदार/1011000322', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(393, 138, 'राजस्व एवं आपदा प्रबंधन विभाग', 'प्रपत्र शाखा कलेक्ट्रेट रायपुर', 'प्रभारी अधिकारी/2311000005', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(394, 139, 'राजस्व एवं आपदा प्रबंधन विभाग', 'भू अर्जन, शाखा, जिला कार्यालय, रायपुर', 'प्रभारी अधिकारी/1011000347', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(395, 140, 'राजस्व एवं आपदा प्रबंधन विभाग', 'भु-अभिलेख, रायपुर', 'अधीक्षक /1011000288', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(396, 141, 'राजस्व एवं आपदा प्रबंधन विभाग', 'वरिष्ठ लिपिक शाखा', 'प्रभारी अधिकारी/1111000547', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(397, 142, 'राजस्व एवं आपदा प्रबंधन विभाग', 'वाचक शाखा', 'प्रभारी अधिकारी/1111000548', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(398, 143, 'राजस्व एवं आपदा प्रबंधन विभाग', 'सहायक अधीक्षक(राजस्व), कार्यालय कलेक्टर, रायपुर', 'प्रभारी अधिकारी/1011000329', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(399, 144, 'लोक निर्माण विभाग', 'लोक निर्माण विभाग (E & M) रायपुर', 'कार्यपालन अभियंता/1911000006', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(400, 145, 'लोक निर्माण विभाग', 'लोक निर्माण विभाग, क्रमांक 1', 'कार्यपालन यंत्री /1011000284', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(401, 146, 'लोक निर्माण विभाग', 'लोक निर्माण विभाग, क्रमांक 3', 'कार्यपालन यंत्री /1011000286', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(402, 147, 'लोक निर्माण विभाग', 'लोक निर्माण विभाग, विधानसभा संभाग्', 'कार्यपालन यंत्री /1011000287', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(403, 148, 'लोक निर्माण विभाग', 'लोक निर्माण विभाग, विधानसभा संभाग्', 'कार्यपालन यंत्री /1011000287', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(404, 149, 'लोक निर्माण विभाग', 'सेतु संभाग लोक निर्माण विभाग', 'कार्यपालन अभियंता/2411000002', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(405, 150, 'लोक स्वास्थ्य यांत्रिकी विभाग', 'Mukhya Abhiyanta, PHE Department, District Office Raipur', 'मुख्य अभियंता /1011000061', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(406, 151, 'लोक स्वास्थ्य, परिवार कल्याण एवं चिकित्सा शिक्षा विभाग', 'जिला चिकित्सालय, रायपुर', 'जिला मलेरिया अधिकारी/1211000025', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(407, 152, 'लोक स्वास्थ्य, परिवार कल्याण एवं चिकित्सा शिक्षा विभाग', 'जिला चिकित्सालय, रायपुर', 'सिविल सर्जन/1011000303', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(408, 153, 'वन एवं जलवायु परिवर्तन विभाग', 'उदन्ती वनमंडल, गरियाबंद', 'वन मण्डलाधिकारी /1011000335', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(409, 154, 'वन एवं जलवायु परिवर्तन विभाग', 'वन अनुसंधान एवं विस्तार वनमंडल, रायपुर', 'वन मण्डलाधिकारी /1011000333', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(410, 155, 'वाणिज्य और उद्योग विभाग', 'जिला उद्योग केंद्र, रायपुर', 'मुख्य महाप्रबंधक /1111000502', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(411, 156, 'वाणिज्यिक कर विभाग', 'स्‍टेट मार्केटिंग कार्पोरेशन', 'अध्यक्ष /1911000010', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(412, 157, 'वित्त विभाग', 'District Treasury Raipur', 'जिला कोषालय अधिकारी /1511000008', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(413, 158, 'वित्त विभाग', 'संयुक्‍त संचालक कोष लेखा पेंशन,', 'संभागीय संयुक्‍त संचालक/2311000007', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(414, 159, 'विधि और विधायी कार्य विभाग', 'जिला उपभोक्ता फोरम', 'अध्यक्ष /2211000003', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(415, 160, 'श्रम विभाग', 'उप संचालक औद्योगिक स्वास्थ्य एवं सुरक्षा रायपुर, जिला रायपुर', 'उप संचालक/2511000016', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(416, 161, 'श्रम विभाग', 'बालश्रम परियोजना, जिला कार्यालय, रायपुर', '', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(417, 162, 'स्कूल शिक्षा विभाग', 'Rajiv Gandhi Siksha Mission', 'उप संचालक/1211000016', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(418, 163, 'सुशासन एवं अभिसरण', 'सुशासन एवं अभिसरण', 'अवर सचिव /2511000013', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(419, 164, 'संस्कृति विभाग', 'छ.ग. सिंधी अकादमी', 'अध्यक्ष /1911000018', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(420, 165, 'संस्कृति विभाग', 'पदुमलाल पुन्‍नालाल बख्‍शी सृजनपीठ', 'अध्यक्ष /1911000017', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(421, 166, 'सहकारिता विभाग', 'छत्‍तीसगढ राज्‍य सहकारी विपणन संघ मर्यादित, जिला रायपुर', 'जिला विपणन अधिकारी/1211000017', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(422, 167, 'सहकारिता विभाग', 'छत्‍तीसगढ राज्‍य सहकारी विपणन संघ मर्यादित, जिला रायपुर', 'राज्य विपणन अधिकारी/1211000026', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(423, 168, 'सहकारिता विभाग', 'संयुक्‍त आयुक्‍त सहकारिता एवं संयुक्‍त पंजीयक सहकारी संस्‍थाएं, रायपुर', 'संयुक्त पंजीयक/1711000063', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(424, 169, 'सहकारिता विभाग', 'सहकारिता विभाग जिला विभाग', 'महानिदेशक /1011000163', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(425, 170, 'सामान्य प्रशासन', 'Collector Office Raipur', 'कलेक्टर /1011000016', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(426, 171, 'सामान्य प्रशासन', 'District Administration-Raipur', 'Admin/2311000001', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(427, 172, 'सामान्य प्रशासन', 'आयुक्त कार्यालय', 'आयुक्त /1211000023', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(428, 173, 'सामान्य प्रशासन', 'जिला निवार्चन, रायपुर', 'उप जिला निर्वाचन अधिकारी /1011000302', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(429, 174, 'सामान्य प्रशासन', 'स्थानीय निर्वाचन शाखा, रायपुर', 'प्रभारी अधिकारी/1011000344', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(430, 175, 'सार्वजनिक उपक्रम विभाग', 'BSNL', 'प्रभारी अधिकारी/1711000051', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(431, 176, 'सार्वजनिक उपक्रम विभाग', 'National Highway', 'कार्यपालन अभियंता/1211000022', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51'),
	(432, 177, 'सार्वजनिक उपक्रम विभाग', 'Post Master General', 'मुख्य पोस्ट मास्टर /1211000019', 0, 0, 0, 0, 0, 0, 0, '2025-08-22 18:31:51');

-- Dumping structure for table samadhan.jansikayatpostmail
DROP TABLE IF EXISTS `jansikayatpostmail`;
CREATE TABLE IF NOT EXISTS `jansikayatpostmail` (
  `id` int NOT NULL AUTO_INCREMENT,
  `pending` int DEFAULT '0',
  `resolve` int DEFAULT '0',
  `total` int GENERATED ALWAYS AS ((`pending` + `resolve`)) STORED,
  `createdAt` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- Dumping data for table samadhan.jansikayatpostmail: ~1 rows (approximately)
DELETE FROM `jansikayatpostmail`;
INSERT INTO `jansikayatpostmail` (`id`, `pending`, `resolve`, `createdAt`) VALUES
	(1, 0, 0, '2025-08-21 08:38:56');

-- Dumping structure for table samadhan.jansikayatweb
DROP TABLE IF EXISTS `jansikayatweb`;
CREATE TABLE IF NOT EXISTS `jansikayatweb` (
  `id` int NOT NULL AUTO_INCREMENT,
  `pending` int DEFAULT '0',
  `resolve` int DEFAULT '0',
  `total` int GENERATED ALWAYS AS ((`pending` + `resolve`)) STORED,
  `createdAt` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- Dumping data for table samadhan.jansikayatweb: ~1 rows (approximately)
DELETE FROM `jansikayatweb`;
INSERT INTO `jansikayatweb` (`id`, `pending`, `resolve`, `createdAt`) VALUES
	(1, 0, 0, '2025-08-21 08:38:56');

-- Dumping structure for table samadhan.login
DROP TABLE IF EXISTS `login`;
CREATE TABLE IF NOT EXISTS `login` (
  `id` int NOT NULL DEFAULT '0',
  `email` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `password` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- Dumping data for table samadhan.login: ~0 rows (approximately)
DELETE FROM `login`;
INSERT INTO `login` (`id`, `email`, `password`) VALUES
	(0, 'demo@samadhan.in', 'demo123');

-- Dumping structure for table samadhan.pgportal
DROP TABLE IF EXISTS `pgportal`;
CREATE TABLE IF NOT EXISTS `pgportal` (
  `id` int NOT NULL AUTO_INCREMENT,
  `pending` int DEFAULT '0',
  `resolve` int DEFAULT '0',
  `total` int GENERATED ALWAYS AS ((`pending` + `resolve`)) STORED,
  `createdAt` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- Dumping data for table samadhan.pgportal: ~1 rows (approximately)
DELETE FROM `pgportal`;
INSERT INTO `pgportal` (`id`, `pending`, `resolve`, `createdAt`) VALUES
	(1, 0, 0, '2025-08-21 08:38:56');

-- Dumping structure for table samadhan.stats
DROP TABLE IF EXISTS `stats`;
CREATE TABLE IF NOT EXISTS `stats` (
  `id` int NOT NULL AUTO_INCREMENT,
  `pending` int DEFAULT '0',
  `resolve` int DEFAULT '0',
  `total` int GENERATED ALWAYS AS ((`pending` + `resolve`)) STORED,
  `createdAt` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- Dumping data for table samadhan.stats: ~0 rows (approximately)
DELETE FROM `stats`;

-- Dumping structure for table samadhan.stats_form
DROP TABLE IF EXISTS `stats_form`;
CREATE TABLE IF NOT EXISTS `stats_form` (
  `id` int NOT NULL AUTO_INCREMENT,
  `sources` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `pending` int DEFAULT '0',
  `resolve` int DEFAULT '0',
  `total` int GENERATED ALWAYS AS ((`pending` + `resolve`)) STORED,
  `createdAt` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- Dumping data for table samadhan.stats_form: ~0 rows (approximately)
DELETE FROM `stats_form`;

-- Dumping structure for trigger samadhan.after_jandarshan_insert
DROP TRIGGER IF EXISTS `after_jandarshan_insert`;
SET @OLDTMP_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO';
DELIMITER //
CREATE TRIGGER `after_jandarshan_insert` AFTER INSERT ON `jandarshan_data` FOR EACH ROW BEGIN
  INSERT INTO jandarshan_data_history (
    original_id,
    main_department,
    department_name,
    officer_designation,
    cm_jandarshan,
    collector_jandarshan,
    jansikayatWEB,
    jansikayatPostMail,
    pgPortal,
    call_center,
    total_complaints,
    snapshot_date
  ) VALUES (
    NEW.id,
    NEW.main_department,
    NEW.department_name,
    NEW.officer_designation,
    NEW.cm_jandarshan,
    NEW.collector_jandarshan,
    NEW.jansikayatWEB,
    NEW.jansikayatPostMail,
    NEW.pgPortal,
    NEW.call_center,
    NEW.total_complaints,
    NOW()
  );
END//
DELIMITER ;
SET SQL_MODE=@OLDTMP_SQL_MODE;

-- Dumping structure for trigger samadhan.after_jandarshan_update
DROP TRIGGER IF EXISTS `after_jandarshan_update`;
SET @OLDTMP_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO';
DELIMITER //
CREATE TRIGGER `after_jandarshan_update` AFTER UPDATE ON `jandarshan_data` FOR EACH ROW BEGIN
  INSERT INTO jandarshan_data_history (
    original_id,
    main_department,
    department_name,
    officer_designation,
    cm_jandarshan,
    collector_jandarshan,
    jansikayatWEB,
    jansikayatPostMail,
    pgPortal,
    call_center,
    total_complaints,
    snapshot_date
  ) VALUES (
    NEW.id,
    NEW.main_department,
    NEW.department_name,
    NEW.officer_designation,
    NEW.cm_jandarshan,
    NEW.collector_jandarshan,
    NEW.jansikayatWEB,
    NEW.jansikayatPostMail,
    NEW.pgPortal,
    NEW.call_center,
    NEW.total_complaints,
    NOW()
  );
END//
DELIMITER ;
SET SQL_MODE=@OLDTMP_SQL_MODE;

/*!40103 SET TIME_ZONE=IFNULL(@OLD_TIME_ZONE, 'system') */;
/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IFNULL(@OLD_FOREIGN_KEY_CHECKS, 1) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40111 SET SQL_NOTES=IFNULL(@OLD_SQL_NOTES, 1) */;
